from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_12_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("กล้วยตาก")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=500)

multi = """
กล้วยตากมีต้นกำเนิดมาจากหลายแห่งในประเทศไทย แต่แหล่งผลิตที่โด่งดังที่สุดคือ อำเภอบางกระทุ่ม จังหวัดพิษณุโลก  ที่นี่มีภูมิอากาศร้อนและแห้ง เหมาะแก่การตากกล้วยให้แห้งสนิท 
โดยไม่ต้องพึ่งเครื่องอบ  กล้วยตากบางกระทุ่มมีเอกลักษณ์เฉพาะตัวคือ  ใช้กล้วยน้ำว้าพันธุ์ "มะลิอ่อง"  ซึ่งมีเนื้อหนา  รสชาติหวานหอม  และเมื่อนำมาตากแดดจนแห้งสนิท  
จะได้กล้วยตากที่มีสีเหลืองทอง  เนื้อเหนียวนุ่ม  หวานอร่อย  เก็บไว้ได้นาน

ประวัติความเป็นมา

สันนิษฐานว่าภูมิปัญญาการตากกล้วยมีมาตั้งแต่สมัยโบราณ  เพื่อเป็นวิธีถนอมอาหาร  โดยเฉพาะในช่วงที่กล้วยออกผลผลิตมากจนรับประทานไม่ทัน  
ในอดีตนิยมตากกล้วยบนแคร่ไม้ไผ่  ใช้แสงแดดธรรมชาติ  แต่ปัจจุบันมีการพัฒนาเทคโนโลยีการตากกล้วยด้วยตู้อบ  ซึ่งช่วยให้ควบคุมอุณหภูมิและความชื้นได้ดีกว่า 
ทำให้ได้กล้วยตากที่มีคุณภาพดี  เก็บไว้ได้นาน

"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    กล้วยน้ำว้าแก่

    เกลือป่น

    น้ำ
        
"""
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    1. ตัดกล้วยออกเป็นหวีนำวางลงบนใบตอง ปิดทับด้วยใบตองและกระสอบ หรือนำใส่โอ่ง หรือถัง จากนั้นบ่มทิ้งไว้จนกล้วยสุกดี (บ่มจนผลกลมมน ไม่มีรอยเหลี่ยมและเปลือกตกกระสีดำ)

    2. ปอกเปลือกกล้วยออกเรียงลงบนตะแกรง นำไปตากแดดจนกล้วยเกือบแห้งสนิทนานประมาณ 5 วัน และหมั่นคอยพลิกกลับด้านอยู่เสมอ

    3. ก่อนนำกล้วยไปตากแดดในวันที่ 6 ให้ละลายน้ำกับเกลือให้เข้ากัน นำขึ้นตั้งไฟต้มจนเดือด ทิ้งไว้จนเย็น จากนั้นใช้ขวดน้ำคลึงหรือกดกล้วยให้แบน 
    แล้วนำกล้วยลงไปล้างในน้ำเกลือที่เตรียมไว้ จากนั้นนำกล้วยวางเรียงบนตะแกรง นำไปตากแดดอีก 1-2 วัน จนกล้วยแห้งได้ที่

    4. เมื่อกล้วยแห้งได้ที่แล้วใส่กล้วยลงในหม้อ ปิดฝาให้สนิท วางทิ้งไว้ 1 คืน เพื่อให้น้ำตาลจากกล้วยซึมออกมา (กล้วยจะเงาและไม่แห้ง) จากนั้นเก็บใส่ภาชนะที่มีฝาปิดมิดชิด พร้อมรับประทาน
        
    """
    st.markdown(multi)

st.page_link("Home.py", label="Home", icon="↩️")
