from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_233_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมอินทนิล")
st.image(kanom_img_path, width=850)
left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")

multi = """
ขนมอินทนิลคือ ขนมที่ใช้แป้งมันสำปะหลังเป็นส่วนผสมหลัก โดยในอดีตแป้งมันสำปะหลังนั้นถือว่าเป็นของที่มีราคาอยู่พอสมควร เนื่องจากเป็นสินค้านำเข้ามาจากประเทศสิงคโปร์ ด้วยเหตุนี้จึงทำให้ ขนม อินทนิล เป็นของหวานที่มีเฉพาะแค่ในรั้วในวังเท่านั้น คนธรรมดาทั่วไปคงมิอาจจะมีโอกาสได้ทานของหวานกันมากนัก และในปัจจุบันแม้ว่าส่วนผสมของขนมชนิดนี้จะหาได้ง่ายขึ้น แต่ถึงกระนั้น ขนมไทยโบราณ ชนิดนี้ก็ยังคงหาทานได้ยากอยู่ คนรุ่นใหม่จำนวนมากอาจจะไม่คุ้นเคยกับของหวานชนิดนี้มากนัก 
"""
st.markdown(multi)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    **ส่วนผสม แป้งอินทนิล**  
    แป้งถั่วเขียว 20 กรัม  
    แป้งมัน 80 กรัม  
    น้ำใบเตย 500 กรัม (ปั่นใบเตย 3/4 ถ้วย + อัญชัญ 10 ดอก + น้ำ 500 กรัม)  
    น้ำตาลทราย 100 กรัม  
      
    **ส่วนผสม น้ำกะทิ**  
    กะทิ 200 กรัม  
    น้ำเปล่า 250 กรัม  
    น้ำตาลทราย 100 กรัม  
    ใบเตย 5 ใบ  
    เกลือป่น  
    เทียนอบ  
    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    1. ทำน้ำใบเตย โดยนำใบเตย ดอกอัญชัญ และน้ำเปล่า มาปั่นรวมกัน แล้วนำมากรองด้วยผ้าขาวบาง เพื่อเอากากออก  
    2. ผสมแป้งมัน แป้งถั่วเขียว และน้ำใบเตย(ส่วนแรก) ใช้ตะกร้อมือคนผสมให้ส่วนผสมเข้ากันดี แล้วค่อยใส่น้ำใบเตยที่เหลือลงไปผสม  
    3. นำพลาสติกแรปมาคลุมชามผสม แล้วพักไว้ก่อน  
    4. ผสมน้ำเปล่า กะทิ น้ำตาลทราย และเกลือเล็กน้อย ในหม้อ แล้วนำไปตั้งไฟ ต้มจนเดือดแล้วนำลงมาพักให้เย็น
    
    5. นำเทียนอบมาวางไว้บนถ้วยฟรอยด์ (เพื่อให้ลอยน้ำได้) จุดเทียน แล้วนำถ้วยฟรอยด์มาวางบนน้ำกะทิ แล้วปิดฝาหม้อ อบไว้อย่างน่อย 1 ชั่วโมง
    
    6. นำแป้งอินทนิล มากวนในหม้อ ใช้ไฟอ่อน คนไปเรื่อยๆ จนส่วนผสมเริ่มเหนียวขึ้น และแป้งใสขึ้น ให้ใส่น้ำตาลทรายลงไป แล้วกวนต่อจนแป้งเหนียวใส เป็นเนื้อเดียวกัน (ตามคลิป)
    
    7. นำแป้งมาพักให้เย็น แล้วตักใส่ถุงร้อน หรือถุงบีบ จากนั้นตัดปลายถุง
    
    8. ตักน้ำกะทิใส่ถ้วย แล้วค่อยๆ บีบตัวแป้งอินทนิลลงไป (ตามคลิป)
    
    9. ใส่น้ำแข็ง พร้อมเสิร์ฟ
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
