from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_97_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมตะโก้")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
ตะโก้  เป็นขนมไทยโบราณที่มีเอกลักษณ์เฉพาะตัว  ลักษณะเป็นขนม 2 ชั้น  ชั้นล่างทำจากแป้งข้าวเจ้าผสมกับน้ำตาลทราย  กวนจนสุกเหนียวข้น  ส่วนชั้นบนเป็นหน้ากะทิ  ทำจากกะทิ  น้ำตาลทราย  แป้งข้าวเจ้า  และเกลือ  นำมาเคี่ยวจนเหนียวข้น  เทราดบนตัวตะโก้  โรยด้วยมะพร้าวขูด  

ที่มาของชื่อ  มีการสันนิษฐานว่า  "ตะโก้"  เพี้ยนมาจากคำว่า  "กะโจ้"  ซึ่งหมายถึง  ภาชนะประเภทหนึ่งที่ทำจากใบตอง  ใช้สำหรับใส่ขนม  หรืออาจจะมาจากคำว่า  "ตะกร้า"  เพราะในสมัยก่อนนิยมนำตะโก้ใส่ตะกร้าไปขาย  

หลักฐานทางประวัติศาสตร์  พบภาพเขียนตะโก้ในสมุดภาพโบราณ  "พระราชพิธีมงคลจดหมาย"  ซึ่งรวบรวมภาพวาดเกี่ยวกับพระราชพิธีและประเพณีต่างๆ  ในสมัยกรุงรัตนโกสินทร์  แสดงให้เห็นว่าตะโก้เป็นขนมที่นิยมรับประทานในงานมงคลต่างๆ  มาช้านาน   

ตะโก้เป็นขนมที่ได้รับความนิยมทั้งในอดีตและปัจจุบัน  นิยมทำรับประทานในงานมงคล  งานเทศกาล  และงานทั่วไป  หาซื้อได้ง่ายตามร้านขนมไทยทั่วไป  
"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
ตัวขนม  
เมล็ดข้าวโพดหวาน 1 ถ้วย  
น้ำต้มใบเตย 3 ถ้วยตวง  
น้ำตาลทรายขาว 1 ถ้วยตวง  
แป้งข้าวเจ้า 1/2 ถ้วยตวง  
  
หน้ากะทิ  
หัวกะทิ 3 + 1/2 ถ้วยตวง  
แป้งข้าวเจ้า 1/2 ถ้วยตวง  
น้ำตาลทรายขาว 2 ช้อนตวง  
เกลือป่น 1 ช้อนชา  
เมล็ดข้าวโพดสำหรับแต่งหน้าขนม  
    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
1. หลังจากที่เราเตรียมวัตถุดิบจนพร้อมแล้ว ให้ตั้งกระทะใส่น้ำต้มใบเตย น้ำตาลทราย แป้งข้าวเจ้าลงไปคนให้เข้ากัน เมื่อส่วนผสมเข้ากันดีแล้วให้เปิดเตาด้วยไฟอ่อน กวนเรื่อย ๆ จนเนื้อแป้งข้นเหนียว ห้ามหยุดกวน เพื่อป้องกันการไหม้ก้นกระทะ ตามด้วยการใส่เมล็ดข้าวโพดลงไปกวนต่อ เสร็จแล้วปิดเตา  
2. นำขนมที่เรากวนเสร็จแล้วตักใส่ลงไปในกระทงใบตอง หรือพิมพ์ภาชนะใส่ขนมตามชอบ โดยเหลือพื้นที่ด้านบนไว้เล็กน้อย เพื่อใส่หน้ากะทิ  
3. ขั้นตอนนี้จะเป็นขั้นตอนการทำหน้ากะทิ โดยนำหัวกะทิ แป้งข้าวเจ้า น้ำตาลทรายขาว และเกลือป่นลงไปคนให้เข้ากันในหม้อ จากนั้นเปิดเตาด้วยไฟอ่อน คนเรื่อย ๆ ให้เข้ากันดี จนมีเนื้อข้นหนืด จากนั้นปิดเตารอให้อุ่นเล็กน้อย แล้วตักหยอดลงไปบนตัวขนม ตามด้วยการนำเมล็ดข้าวโพดมาตกแต่งหน้าขนมตามชอบเป็นอันเสร็จสิ้น
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
