from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
header_img_path = os.getenv("HEADER_IMG_PATH")
khanombodin_path = os.getenv("COMPONENT_137_PATH1")

# Set page configuration
st.set_page_config(
    page_title="ขนมบดิน: ขนมมงคลสูตรโบราณ",
    page_icon="🍰",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมบดิน: ขนมมงคลสูตรโบราณ")
st.image(image=khanombodin_path)

st.title("ความเป็นมา")
with st.expander("ความเป็นมา"):
    st.markdown(
        """
        ขนมบดิน เป็นขนมมงคลของชาวไทยมุสลิม มีลักษณะเป็นก้อนกลม มันฟู หอมหวาน นิยมทานคู่กับชาหรือกาแฟ มีความเป็นเอกลักษณ์ทางวัฒนธรรมและประเพณีในงานพิธีสำคัญต่างๆ เช่น งานแต่งงาน และงานบวงสรวง
        """
    )

st.title("วิธีทำ")
with st.expander("วิธีทำ"):
    st.markdown(
        """
        ส่วนผสม:
        - แป้งเค้ก 200 กรัม
        - นมข้นหวาน 1 กระป๋อง
        - นมจืด 1/2 ถ้วยตวง
        - ไข่ไก่ 3 ฟอง
        - เนย 100 กรัม
        - น้ำตาลทราย 1/2 ถ้วยตวง
        - ผงฟู 1 ช้อนชา
        - เกลือ 1/4 ช้อนชา
        - กลิ่นวานิลลา 1 ช้อนชา
        
        วิธีทำ:
        1. ร่อนแป้งเค้ก ผงฟู และเกลือเข้าด้วยกัน
        2. ตีเนยกับน้ำตาลทรายจนขึ้นฟู
        3. ใส่ไข่ไก่ทีละฟอง ตีจนเข้ากัน
        4. ใส่ส่วนผสมของแป้งสลับกับนมข้นหวานและนมจืด ตีจนเข้ากัน
        5. ใส่กลิ่นวานิลลา ตีต่อจนเข้ากัน
        6. เทแป้งลงในพิมพ์ที่ทาเนยและโรยแป้งไว้แล้ว
        7. อบไฟ 180 องศาC ประมาณ 30-40 นาที หรือจนสุก
        """
    )

st.title("หน้าขนม")
with st.expander("หน้าขนม"):
    st.markdown(
        """
        ส่วนผสม:
        - ไข่ไก่ 1 ฟอง
        - เนย 50 กรัม
        - น้ำตาลทราย 50 กรัม
        - นมข้นหวาน 2 ช้อนโต๊ะ
        - กลิ่นวานิลลา 1/2 ช้อนชา
        - ลูกเกด 1/2 ถ้วยตวง
        - มะม่วงหิมพานต์ 1/2 ถ้วยตวง
        - ฟักเชื่อม 1/2 ถ้วยตวง
        
        วิธีทำ:
        1. ตีไข่ไก่กับน้ำตาลทรายจนขึ้นฟู
        2. ใส่เนยละลาย นมข้นหวาน และกลิ่นวานิลลา ตีจนเข้ากัน
        3. นำแป้งที่อบสุกแล้วมาพักไว้ให้เย็น
        4. ทาหน้าขนมด้วยส่วนผสมที่เตรียมไว้
        5. โรยหน้าด้วยลูกเกด มะม่วงหิมพานต์ และฟักเชื่อม
        """
    )

st.title("เคล็ดลับ")
with st.expander("เคล็ดลับ"):
    st.markdown(
        """
        - เลือกใช้เนยสด จะทำให้ขนมมีกลิ่นหอม
        - ตีเนยกับน้ำตาลทรายจนขึ้นฟู จะทำให้เนื้อขนมนุ่มฟู
        - อบไฟด้วยอุณหภูมิที่พอเหมาะ จะทำให้ขนมสุกทั่ว ไม่ไหม้
        - ทาหน้าขนมหลังจากที่ขนมเย็นสนิทแล้ว จะทำให้หน้าขนมไม่ละลาย
        """
    )

st.page_link("Home.py", label="Home", icon="↩️")
