from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_102_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมตูโบ้")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
ตูโบ้ คือ แกงบวดรวมมิตรที่นำมันเทศ เผือก ถั่วแดง และแผ่นแป้งมันสำปะหลังมาต้มกับกะทิใส่น้ำตาลทราย ขนมหวานท้องถิ่นของคนภูเก็ต คำว่า ตู หมายถึง หมู คำว่าโบ้ หมายถึงแม่ เมื่อรวมกันแล้ว “ตูโบ้” หมายถึง แม่หมู ซึ่งน่าจะเป็นเพราะของหวานนี้นำส่วนผสมหลายอย่างมาต้มรวมกันเหมือนต้มให้แม่หมูกิน
 
"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    มันเทศ 120 กรัม (หั่นเป็นสี่เหลี่ยมข้าวหลามตัดขนาดพอดี)  
    เผือก 120 กรัม (หั่นสี่เหลี่ยมข้าวหลามตัดขนาดพอดี วันนี้เราใช้เผือกที่เหลือจากทำแกง ซึ่งหั่นเป็นสี่เหลี่ยมเล็กๆ)  
    ถั่วแดงเม็ดเล็ด 100 กรัม (ภูเก็ตเรียกถั่วย้อแย้ วันนี้เราใช้ถั่วแดงกระป๋อง เพราะสะดวกดี)  
    แป้งมันสำปะหลัง (ภูเก็ตเรียกแป้งแป้งตั่วจูหุ้น) ต้มสุกแล้ว  
    น้ำตาลทราย 1/2 ถ้วยตวง  
    กะทิ 2 ถ้วยตวง  
    เกลือป่น 1/2 ช้อนชา  
    (เครื่องประกอบข้างต้นทำได้ประมาณ 4-5 ที่)  
    

    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    การทำแป้งมันสำปะหลัง
แป้งมันสำปะหลัง 1/2 ถ้วยตวง (เผื่อไว้อีกส่วนสำหรับทำเป็นแป้งนวลตอนนวดแป้งและตอนคลึง) น้ำเดือดจัด 1/4 ถ้วยตวง (อาจไม่ใช้หมด หรืออาจมากกว่านี้)  
- เทแป้งใส่ชาม ค่อยๆใส่น้ำเดือดลงไปทีละน้อย ระหว่างใส่คนไปด้วย คนจนแป้งจับเป็นก้อน หยุดใส่น้ำได้ แล้วก็ใช้มือนวดแป้งจนเนียนเหนียว ถ้าแป้งแฉะไปก็เติมแป้งมันเพิ่มทีละน้อย  
- โรยแป้งนวลบนโต๊ะและบนแป้งโดว์ คลึงแป้งเป็นแผ่นบางๆ แล้วตัดเป็นสี่เหลี่ยมข้าวหลามตัด ตัดแป้งเสร็จหมดแล้ว ก็เอาน้ำสะอาดใส่หม้อ ตั้งไฟปานกลาง พอน้ำเดือด ใส่แป้งที่ทำไว้ลงไปต้ม  
- ต้มจนแป้งสุกลอยตัวขึ้นมา สัก 1 – 2 นาที ตักออกมาแช่น้ำเย็นไว้ แป้งจะใสกว่าเดิม เอาไปทำขนมได้  

วิธีทำขนม  
ตวงกะทิใส่หม้อตั้งไฟปานกลาง ใส่มันเทศและเผือกลงไป ต้มจนเผือกและมันเริ่มสุก ใส่ถั่วแดงและแป้งที่ทำไว้ลงไป คนเข้ากันแล้วเติมน้ำตาล และเกลือป่นลงไป พอน้ำตาลละลายดีแล้ว ปิดไฟได้   
    
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
