from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_33_PATH1")

# Set page configuration
st.set_page_config(
    page_title="ขนมข้าวต้มมัด: เอกลักษณ์ความอร่อยจากภูมิปัญญาไทย",
    page_icon="🍚",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(image=header_img_path)
# Display title
st.title("ขนมข้าวต้มมัด: เอกลักษณ์ความอร่อยจากภูมิปัญญาไทย")
st.image(kanom_img_path)
st.title("ประวัติความเป็นมา")
with st.expander("ประวัติความเป็นมา"):
    st.markdown(
        """
        เชื่อกันว่า ขนมข้าวต้มมัดมีต้นกำเนิดมาจากภาคอีสานของไทย โดยในอดีตนิยมทำรับประทานกันในงานบุญต่างๆ เช่น งานเข้าพรรษา งานออกพรรษา หรือใช้เป็นของไหว้บรรพบุรุษ
        ขนมข้าวต้มมัดนั้น สะท้อนให้เห็นถึงภูมิปัญญาและวิถีชีวิตของชาวอีสานที่ผูกพันกับธรรมชาติ โดยใช้ใบตองซึ่งเป็นพืชท้องถิ่นมาห่อข้าวเหนียว แสดงถึงความกตัญญูและความเคารพต่อบรรพบุรุษ
        """
    )

st.title("เอกลักษณ์ของขนมข้าวต้มมัด")
with st.expander("เอกลักษณ์ของขนมข้าวต้มมัด"):
    st.markdown(
        """
        - **กลิ่นหอม:** ขนมข้าวต้มมัดมีกลิ่นหอมเป็นเอกลักษณ์จากใบตอง
        - **รสชาติกลมกล่อม:** หวานมันเค็ม จากข้าวเหนียว กะทิ กล้วย และถั่วดำ
        - **ความสวยงาม:** ขนมข้าวต้มมัดมีสีสันสวยงาม จากใบตองสีเขียว ข้าวเหนียวสีขาว กล้วยสีเหลือง และถั่วดำสีดำ
        - **ความหมายดีงาม:** สื่อถึงความสามัคคี ความเจริญรุ่งเรือง และโชคลาภ
        """
    )

st.title("ส่วนผสมและวิธีทำ")
with st.expander("ส่วนผสมและวิธีทำ"):
    st.markdown(
        """
        **วัตถุดิบ:**
        - ข้าวเหนียวเขี้ยวงู 1 กิโลกรัม
        - กล้วยน้ำว้าสุก 5-6 ลูก
        - ถั่วดำ 250 กรัม
        - กะทิ 5 ถ้วยตวง
        - น้ำตาลทราย 200 กรัม
        - เกลือ 1 ช้อนโต๊ะ
        - ใบตองสำหรับห่อ

        **วิธีทำ:**
        1. แช่ข้าวเหนียวกับน้ำเปล่าไว้ประมาณ 3-4 ชั่วโมง
        2. ต้มถั่วดำจนสุก
        3. ผสมกะทิ น้ำตาลทราย และเกลือ ตั้งไฟเคี่ยวจนน้ำตาลทรายละลาย
        4. นำข้าวเหนียวที่แช่ไว้ เทใส่กะทิที่เคี่ยวไว้ ผัดจนข้าวเหนียวสุกและแห้ง
        5. ใส่ถั่วดำที่ต้มสุก ผัดคลุกเคล้าให้เข้ากัน
        6. พักไว้ให้เย็นสนิท
        7. เตรียมใบตองโดยล้างให้สะอาด ตัดเป็นชิ้นสี่เหลี่ยมจัตุรัส
        8. ปอกกล้วยน้ำว้าสุก หั่นเป็นชิ้นพอดีคำ
        9. ตักข้าวเหนียวที่เตรียมไว้ใส่ลงในใบตอง วางกล้วยน้ำว้าสุกไว้ตรงกลาง ห่อใบตองให้แน่นและมัดด้วยตอก
        10. ตั้งน้ำให้เดือด นำขนมข้าวต้มมัดที่ห่อไว้ไปต้มประมาณ 45-60 นาที หรือจนกว่าข้าวเหนียวจะสุก
        11. ตักขนมข้าวต้มมัดที่ต้มสุกแล้วออกมาพักให้สะเด็ดน้ำ
        12. แกะใบตองออก ทานคู่กับมะพร้าวขูดและน้ำตาลทราย
        """
    )

st.title("เคล็ดลับ")
with st.expander("เคล็ดลับ"):
    st.markdown(
        """
        - เลือกใช้กล้วยน้ำว้าสุกงอม จะทำให้ขนมข้าวต้มมัดมีรสชาติหวานอร่อยยิ่งขึ้น
        - มัดใบตองให้แน่น เพื่อป้องกันไม่ให้น้ำไหลเข้าไปในตัวขนม
        - ปรับปริมาณน้ำตาลทรายได้ตามชอบ"""
    )
st.page_link("Home.py", label="Home", icon="↩️")
