from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_153_PATH1")

# Set page configuration
st.set_page_config(
    page_title="ขนมผิง: ขนมไทยโบราณ เนื้อกรอบ หอม หวานมัน ทานเล่นหรือทานคู่กับอาหารคาว",
    page_icon="🥥",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(header_img_path)
# Display title
st.title("ขนมผิง: ขนมไทยโบราณ เนื้อกรอบ หอม หวานมัน ทานเล่นหรือทานคู่กับอาหารคาว")
st.image(kanom_img_path)
st.title("ความเป็นมา")
with st.expander("ความเป็นมา"):
    st.markdown(
        """
        ขนมผิงเป็นขนมไทยโบราณที่มีมานานกว่า 400 ปี มีต้นกำเนิดมาจากในสมัยกรุงศรีอยุธยา นิยมทำกันในงานมงคล งานประเพณี และทานเล่นทั่วไป เชื่อกันว่าขนมชนิดนี้เป็นสิริมงคล ช่วยให้ผิวพรรณผ่องใส
        เอกลักษณ์ของขนมผิงคือ เนื้อขนมกรอบ กลมกล่อม ละลายในปาก มีกลิ่นหอม ทานคู่กับชาหรือกาแฟ
        """
    )

st.title("ส่วนผสม")
st.markdown(
    """
    - แป้งมัน 500 กรัม
    - กะทิ 250 กรัม
    - น้ำตาลทราย 250 กรัม
    - ไข่แดง 2 ฟอง
    - ใบเตย (สำหรับเพิ่มความหอม)
    """
)

st.title("วิธีทำ")
with st.expander("วิธีทำ"):
    st.markdown(
        """
        1. ผสมกะทิกับน้ำตาลทราย คนให้ละลาย นำขึ้นตั้งไฟเคี่ยวจนเป็นยางมะตูม ยกลงพักไว้ให้อุ่น
        2. พอกะทิอุ่น ใส่ไข่แดงลงไปผสมให้เข้ากัน
        3. ค่อยๆ ใส่แป้งมันลงไป คนให้เข้ากันจนแป้งสุกจับตัวเป็นก้อน
        4. นำแป้งมาปั้นเป็นก้อนกลมๆเล็กๆบนถาดเหล็ก
        5. นำไปฝั่งบนเตาถ่านเรียกว่า "ยิ่งล่าง ผิงบน" มีถ่านร้อนอยู่ด้านล่างและมีถาดใส่ ถ่านชักรอกอยู่ด้านบนสำหรับการใช้ไฟ
        6. ต้องเขี่ยถ่านหรือฟื้นไว้รอบๆตรงกลางใช้ไฟน้อย ขนมที่สุกจะมีสีขาวแกมเหลืองนิด
        7. พักจนเย็นแล้ว นำไปอบควันเทียนเป็นอันเสร็จเรียบร้อย
        """
    )

st.title("หมายเหตุ")
with st.expander("หมายเหตุ"):
    st.markdown(
        """
        - ควรใช้กะทิสด จะได้ขนมที่มีรสชาติหอมมัน
        - สามารถปรับปริมาณน้ำตาลทรายได้ตามชอบ
        - ควรอบขนมควันเทียนในภาชนะที่ปิดมิดชิด จะได้ขนมที่มีกลิ่นหอม
        """
    )

st.page_link("Home.py", label="Home", icon="↩️")
