from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_77_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมจีโจ้, ขนมงาทอด")

left_co, cent_co, last_co = st.columns(3)
st.title("ขนมจีโจ้: ขนมพื้นเมืองภูเก็ต หอมงา ไส้เยิ้ม")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
“ขนมจี้โจ้”  เป็นขนมพื้นเมืองภูเก็ตที่มีเอกลักษณ์โดดเด่น
ด้วยแป้งบางกรอบ โรยงาขาว คลุกเคล้ากับไส้หวานมันหลากหลายชนิด 
ข้างในมีไส้รสชาติค่อนข้างหวาน มีด้วยกันสามแบบ คือ ไส้ถั่วเหลือง ถั่วดำ และถั่วลิสง 
การปั้นห่อแผ่แป้งออก วางไส้ไว้ลงกลางแป้ง แล้วจับแป้งหุ้มไส้ 
คลึงให้กลม นำไปคลุกกับงาจากนั้นนำไปทอดในน้ำมันร้อน 
ใช้กระชอนคลึงแป้งในน้ำมัน สักพักขนมจะสุกและจะลอยตัวขึ้นมา 
มีกลิ่นหอมของแป้งและงา สีสันสวยงาม น่าทาน
"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    แป้ง  
    • แป้งข้าวเหนียว 200 กรัม  
    • แป้งข้าวเจ้า 50 กรัม  
    • แป้งข้าวโพด 15 กรัม  
    • ผงฟู 1 ช้อนชา  
    • มันฝรั่งนึ่งสุกบด 150 กรัม  
    • น้ำอุ่นจัด 155 กรัม  
    • เกลือป่น 1/2 ช้อนชา  
    • น้ำมันพืช 20 กรัม  
    • น้ำตาลทรายขาว 70 กรัม  
    • งาขาวสำหรับคลุก  

    ไส้  
    • ถั่วเขียวเลาะเปลือก 150 กรัม  
    • มะพร้าวขูดขาว 50 กรัม  
    • เกลือป่น 1/4 ช้อนชา  
    • น้ำตาลทรายขาว 50 กรัม  
    • น้ำมันพืช 30 กรัม  
   
    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    1. เทน้ำเปล่าร้อนๆ ลงชามผสม ตามด้วยน้ำตาลทรายขาว และเกลือป่น คนผสมให้เข้ากัน พักไว้  
    2. เตรียมชามผสมแป้ง ใส่แป้งข้าวเหนียว ตามด้วยแป้งข้าวเจ้า และแป้งข้าวโพด ผงฟู คนให้ส่วนผสมเข้ากัน   
    3. ใส่มันฝรั่งบดลงไป และน้ำมันพืช คนให้มันฝรั่งกับแป้งเข้ากัน ทยอยใส่น้ำที่พักไว้ลงไป โดยค่อยๆ ใส่และคนให้เข้ากัน ไม่ให้แป้งจับเป็นก้อน  
    4. จากนั้นใช้มือนวดให้แป้งเหนียวเข้ากันดี นำไปพักไว้ 1 ชั่วโมง  
    5. ระหว่างรอพักแป้ง ให้มาทำส่วนไส้ โดยนำถั่วเขียวเลาะเปลือกนึ่งให้สุก นำมาใส่ลงบนกระทะ ตามด้วยมะพร้าวขูดขาว น้ำตาลทรายขาว เกลือป่น น้ำมันพืช เปิดแก๊สใช้ไฟอ่อนในการผัดไส้  
    6. ผัดไปเรื่อยๆ อย่าหยุดมือ ไม่เช่นนั้นถั่วจะไหม้ได้ ผัดจนส่วนผสมเข้ากันดีจนไม่ติดกระทะ ถือว่าใช้ได้ ตัดออกมาพักไว้ให้หายร้อน  
    7. นำไส้มาปั้นเป็นลูกๆ โดยกะให้ไส้มีขนาด 20 กรัม ส่วนแป้ง นำแบ่งออกมาให้ได้ก้อนละ 30 กรัม นำมาแผ่ให้เป็นแผ่นบางๆ ใส่ไส้ลงไปและคลุมให้มึด คลึงให้กลม   
    8. นำแป้งที่ปั้นเรียบร้อย นำมาคลุกงาขาว โดยนำแป้งมาคลึงที่มือที่เปียกน้ำของเราก่อน จะทำให้งาขาวติดแป้งดี   
    9. นำไปทอดโดยใช้ไฟกลางค่อนอ่อน ใส่น้ำมันท่วมกระทะ โดยช่วงแรกต้องคนตลอดเวลา เมื่อขนมเริ่มลอยตัวขึ้นมา ให้ใช้กระชอนกดที่แป้ง เพื่อให้ขนมงาทอดพองตัวสวย พอได้ที่แล้ว นำตักมาสะเด็ดน้ำมัน เป็นอันเสร็จ  
        
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
