from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_30_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมข้าวต้มจิ้ม: เสน่ห์ความอร่อยของภูมิปัญญาไทย",
    page_icon="🍚",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(image=header_img_path)
# Display title
st.title("ขนมข้าวต้มจิ้ม: เสน่ห์ความอร่อยของภูมิปัญญาไทย")
st.image(kanom_img_path)
st.title("ประวัติความเป็นมา")
with st.expander("ประวัติความเป็นมา"):
    st.markdown(
        """
        ขนมข้าวต้มจิ้ม หรือที่รู้จักกันในอีกชื่อว่า "ข้าวต้มหัวหงอก" เป็นขนมไทยโบราณที่มีเอกลักษณ์เฉพาะตัวด้วยกรรมวิธีการทำที่เรียบง่ายแต่แฝงไว้ด้วยภูมิปัญญา ผสมผสานวัตถุดิบธรรมชาติที่หาได้ง่ายเข้าด้วยกันจนกลายเป็นเมนูทานเล่นแสนอร่อยที่ได้รับความนิยมมาอย่างยาวนาน
        """
    )

st.title("เอกลักษณ์ของขนมข้าวต้มจิ้ม")
with st.expander("เอกลักษณ์ของขนมข้าวต้มจิ้ม"):
    st.markdown(
        """
        - **ความหอมหวาน:** ขนมข้าวต้มจิ้มมีกลิ่นหอมจากใบตองและความหวานละมุนจากกล้วยน้ำว้าสุก
        - **ความนุ่มหนึบ:** ข้าวเหนียวที่ต้มจนสุกกำลังดี ให้สัมผัสนุ่มหนึบ ทานคู่กับมะพร้าวขูดและน้ำตาลทราย เพิ่มรสชาติกลมกล่อม
        - **ความเรียบง่าย:** ขนมข้าวต้มจิ้มใช้วัตถุดิบธรรมชาติที่หาได้ง่าย วิธีการทำก็ไม่ยุ่งยาก เหมาะสำหรับทุกเพศทุกวัย
        """
    )

st.title("ส่วนผสมและวิธีทำ")
with st.expander("ส่วนผสมและวิธีทำ"):
    st.markdown(
        """
        **วัตถุดิบ:**
        - ข้าวเหนียวเขี้ยวงู 1 ถ้วย
        - กล้วยน้ำว้าสุก 4-5 ลูก
        - ใบตอง
        - มะพร้าวขูด
        - น้ำตาลทราย
        - เกลือ

        **วิธีทำ:**
        1. แช่ข้าวเหนียวเขี้ยวงูกับน้ำเปล่าประมาณ 3-4 ชั่วโมง
        2. เตรียมใบตองโดยล้างให้สะอาด ตัดเป็นชิ้นสี่เหลี่ยมจัตุรัส
        3. นำกล้วยน้ำว้าสุกมาหั่นเป็นชิ้นพอดีคำ
        4. ผสมมะพร้าวขูดกับน้ำตาลทรายและเกลือเล็กน้อย
        5. ตักข้าวเหนียวที่แช่ไว้ใส่ลงในใบตอง วางกล้วยน้ำว้าสุกไว้ตรงกลาง ห่อใบตองให้แน่นและมัดด้วยตอก
        6. ตั้งน้ำให้เดือด นำขนมข้าวต้มจิ้มที่ห่อไว้ไปต้มประมาณ 45-60 นาที หรือจนกว่าข้าวเหนียวจะสุก
        7. ตักขนมข้าวต้มจิ้มที่ต้มสุกแล้วออกมาพักให้สะเด็ดน้ำ
        8. ตัดขนมข้าวต้มจิ้มเป็นชิ้นพอดีคำ คลุกเคล้ากับมะพร้าวขูดที่เตรียมไว้ ทานคู่กับน้ำตาลทราย
        """
    )

st.title("เคล็ดลับ")
with st.expander("เคล็ดลับ"):
    st.markdown(
        """
        - เลือกใช้กล้วยน้ำว้าสุกงอม จะทำให้ขนมข้าวต้มจิ้มมีรสชาติหวานอร่อยยิ่งขึ้น
        - มัดใบตองให้แน่น เพื่อป้องกันไม่ให้น้ำไหลเข้าไปในตัวขนม
        - ปรับปริมาณน้ำตาลทรายได้ตามชอบ
        """
    )

st.page_link("Home.py", label="Home", icon="↩️")
