from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_66_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมครก")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=500)

multi = """
มีหลักฐานว่า "ขนมครก" เป็นที่นิยมแพร่หลายมาตั้งแต่ "สมัยอยุธยา" โดยมีการทำ "เตาขนมครก" ขายมาตั้งแต่ในยุคนั้น (นอกจากนี้ยังพบในพม่า ลาว และอินโดนีเซีย)  
  
"ขนมครกแต่เดิม" ใช้ข้าวเจ้าแช่น้ำ โม่รวมกับหางกะทิ ข้าวสวย และมะพร้าวทึนทึกขูดฝอย ผสมเกลือเล็กน้อย ใช้เป็นตัวขนม (ส่วนหน้าของขนมครก จะเป็น "หัวกะทิ")  
  
"ขนมครกชาววัง" จะมีการดัดแปลงหน้าขนมครกให้แปลกไป เช่น  
- หน้ากุ้ง (แบบเดียวกับข้าวเหนียวหน้ากุ้ง)  
- หน้าไข่ หน้าหมู (แบบเดียวกับไส้ปั้นสิบ)  
- หน้าเผือก  
- หน้าข้าวโพด  
- หน้าต้นหอม  

"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    **วัตถุดิบแป้งขนมครก**  
    1. แป้งข้าวเจ้า 200 กรัม

    2. แป้งข้าวเหนียว 25 กรัม

    3. หัวกะทิ 1 ½ ถ้วยตวง

    4. น้ำร้อนจัด 1 ½ ถ้วยตวง

    5. น้ำตาลทราย 1 ช้อนโต๊ะ

    6. เกลือ 1 ช้อนชา

    7. น้ำมันพืช 2 ช้อนโต๊ะ (สำหรับทาเตาขนมครก)  
      
      
    **วัตถุดิบหน้าขนมครก**  
    1. หัวกะทิ 1 ½ ถ้วยตวง

    2. น้ำตาลทราย 1/2 ถ้วยตวง

    3. เกลือ 1 ช้อนชา

    4. แป้งข้าวเจ้า 1 ช้อนโต๊ะ

    5. เครื่องโรยหน้าขนมครก (ต้นหอมซอย ข้าวโพด)

"""
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    **Step 1 : เตรียมแป้งขนมครก** 
    - ผสมแป้งข้าวจ้าว แป้งข้าวเหนียว น้ำตาล และเกลือรวมกันไว้

    - ค่อย ๆ ใส่หัวกะทิลงไป คอยตะล่อมส่วนผสมไปด้วย

    - แล้วก็ค่อย ๆ ใส่น้ำร้อนจัดตามลงไป คอยคนส่วนผสมไปด้วยจนเข้ากันดีพักไว้
      
    **Step 2 : เตรียมหน้ากะทิ**  

    - จากนั้นมาทำหน้ากะทิกันค่ะ ใส่น้ำตาลทรายเกลือ และแป้งข้าวเจ้าลงในชามผสมอีกใบ

    - ตะล่อมส่วนผสมแล้วค่อย ๆ ใส่หัวกะทิลงไปด้วย คนจนเข้ากันดีแล้วพักไว้ค่ะ 
        
    **Step 3 : ทำขนมครก + จัดเสิร์ฟ**

    - ใช้ผ้าชุบน้ำมันพืชทาหน้าเตาขนมครกให้ทั่ว ตั้งไฟร้อนปานกลาง ค่อย ๆ หยอดแป้งขนมครกลงไปในหลุม เหลือขอบไว้เล็กน้อยสำหรับโรยหน้ากะทิ

    - เมื่อแป้งเริ่มสุกเล็กน้อย หยอดหน้ากะทิตามลงไปอย่าให้เกินขอบหลุม จากนั้นปิดฝาเตาไว้สักครู่

    - โรยเครื่องขนมครกลงไปในแต่ละหลุม มากน้อยตามใจชอบ แล้วปิดฝาอีกรอบค่ะ 
    
   **Tip** : ควรโรยเครื่องขนมครกลงไปขณะแป้งยังไม่สุกมาก แป้งจะได้ช่วยยึดเครื่องขนมครกเอาไว้ค่ะ

    - รอจนขอบขนมครกเริ่มสุกกรอบเป็นสีน้ำตาล จากนั้นใช้ช้อนแคะออกจากหลุม จัดเสิร์ฟได้เลยค่ะ 
   """
    st.markdown(multi)

st.page_link("Home.py", label="Home", icon="↩️")
