from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_151_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมปุยฝ้าย: ขนมมงคล สูตรโบราณ เนื้อนุ่มฟู หอมหวาน ละมุนลิ้น",
    page_icon="🍮",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(header_img_path)
# Display title
st.title("ขนมปุยฝ้าย: ขนมมงคล สูตรโบราณ เนื้อนุ่มฟู หอมหวาน ละมุนลิ้น")
st.image(kanom_img_path)
st.title("ความเป็นมา")
with st.expander("ความเป็นมา"):
    st.markdown(
        """
        ขนมปุยฝ้าย หรือ ขนมถ้วยฟู เป็นขนมมงคลโบราณที่มีมาช้านาน นิยมทำกันในงานมงคล งานไหว้เจ้า และทานเล่นทั่วไป เชื่อกันว่าขนมปุยฝ้ายนั้น สื่อถึงความเจริญรุ่งเรือง เฟื่องฟู โชคลาภ
        เอกลักษณ์ของขนมชนิดนี้คือ เนื้อขนมนุ่มฟู สีสันสวยงาม มีกลิ่นหอม ละมุนลิ้น ทานง่าย
        """
    )

st.title("ส่วนผสม")
st.markdown(
    """
    - แป้งเค้ก 250 กรัม
    - น้ำตาลทราย 250 กรัม
    - ผงฟู 1 1/2 ช้อนชา
    - ไข่ไก่ 2 ฟอง
    - นมสด 250 ml.
    - น้ำมะนาว 1 ช้อนโต๊ะ
    - SP 10 กรัม
    - กลิ่นวานิลลา (แบบน้ำ) 2 ช้อนชา (หรือกลิ่นมะลิ 1/2 ช้อนชา, หรือ กลิ่นนมแมว 1/2 ช้อนชา เลือกได้ตามความชอบ)
    """
)

st.title("วิธีทำ")
with st.expander("วิธีทำ"):
    st.markdown(
        """
        1. ร่อนแป้งเค้ก และผงฟูใส่ลงกระชอน แล้วนำไปร่อน
        2. เอาแป้งที่ร่อนเสร็จใส่ในภาชนะ ใส่น้ำตาลทราย ไข่ไก่ นมสดรสจืด ตามด้วยกลิ่นวานิล (ใส่กลิ่นมะลิ หรือนมแมวก็ได้) ใส่น้ำมะนาว สีผสมอาหาร (สีชมพู ถ้าชอบเข้มก็ใส่เยอะหน่อย) ตามด้วย SP จะช่วยทำให้ขนมขึ้นฟูเบา ประมาณ 10 กรัม
        3. ตีส่วนผสมด้วยเครื่องตีมือไฟฟ้า ความเร็วต่ำ ประมาณ 1 นาที
        4. เปลี่ยนเป็นความเร็วปานกลาง ตีต่อประมาณ 3 นาที
        5. เปลี่ยนเป็นความเร็วสูง ตีต่อประมาณ 5 นาที หรือจนกว่าเนื้อแป้งจะข้นฟู
        6. เตรียมพิมพ์โดยทาเนยบางๆ
        7. เทแป้งใส่พิมพ์ ประมาณ 70-80% ของพิมพ์
        8. นึ่งด้วยไฟแรง ประมาณ 15-20 นาที หรือจนกว่าขนมจะสุก
        9. พักไว้ให้เย็นก่อนแกะออกจากพิมพ์
        """
    )

st.title("หมายเหตุ")
with st.expander("หมายเหตุ"):
    st.markdown(
        """
        - สามารถปรับปริมาณน้ำตาลทรายได้ตามชอบ
        - ควรใช้ไข่ไก่ที่เย็น จะทำให้ขนมขึ้นฟู
        - ตีแป้งด้วยความเร็วที่สม่ำเสมอ จะทำให้เนื้อขนมเนียน
        - นึ่งขนมด้วยไฟแรง จะทำให้ขนมขึ้นฟูสวย
        - พักขนมไว้ให้เย็นก่อนแกะออกจากพิมพ์ จะทำให้ขนมไม่ยุบ
        """
    )

st.page_link("Home.py", label="Home", icon="↩️")
