from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_95_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมดาราทอง หรือทองเอกกระจัง")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
ดาราทองเป็นขนมที่เกิดขึ้นในยุดก่อนที่จอมพล ป. พิบูลย์สงคราม จะเป็นนายกรัฐมนตรี โดยคุณป้าของคุณหญิงเจือ นครราชเสนี ท่านประดิษฐ์ดัดแปลงทำขึ้นมา และเรียกชื่อว่าขนม “ทองเอกกระจัง” เมื่อคราวงานปีใหม่ในยุคที่จอมพล ป. ขึ้นเป็นนายกรัฐมนตรี คุณหญิงเจือได้นำขนมชนิดนี้ส่งเข้าประกวดโดยตั้งชื่อใหม่ว่า “ดาราทอง” ภายหลังดาราทองนี้กลับถูกเรียกเป็นขนมจ่ามงกุฎ เข้าใจว่าการเรียกผิดฝาผิดตัวนี้เกิดในราว พ.ศ. สองพันห้าร้อยสิบกว่าๆ จากคำบอกเล่าของท่านที่ไม่ขอเปิดเผยตัว ว่า เกิดพลาดที่ตำราเล่มหนึ่งในยุคนั้น มีการตีพิมพ์ชื่อเสียงเรียงนามผิด และภายหลังตำราเล่มนี้กลายเป็นหนึ่งในคัมภีร์ขนมไทยตำรับเก่า แทบทุกสถาบันการเรือนยุคแรกๆยึดถือเป็นต้นแบบ จึงทำให้ดาราทองกลายเป็นจ่ามงกุฎไปโดยปริยา
"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
กวาดเมล็ดแตงโม ในน้ำเชื่อม  
เมล็ดแตงโมแกะ 1 กำมือ  
น้ำตาลทราย 1 ถ้วย  
น้ำเปล่า 1/2 ถ้วย  
  
ฐานขนม  
แป้งสาลี 40 กรัม  
ไข่แดง ไข่ไก่ 1 ฟอง  
น้ำเปล่า  
  
ตัวขนมดาราทอง หรือทองเอกกระจัง  
แป้งข้าวเจ้า 40 กรัม  
แป้งท้าว 10 กรัม   
แป้งมัน 10 กรัม  
เกลือ 1/4 ช้อนชา  
น้ำตาลทราย 50 กรัม  
กะทิ 200 มิลลิกรัม  
ไข่แดง ไข่ไก่ 1 ฟอง  
สีผสมอาหาร สีเหลืองไข่ไก่  
    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
1. ผสมน้ำเปล่ากับน้ำตาลเพื่อทำน้ำเชื่อม ไว้กวาดเมล็ดแตงโม

2. นำเมล็ดแตงโมคั่วบนเตา ใช้มือจุ่มน้ำเชื่อม กวาดเมล็ดแตงโมให้ขึ้นเกร็ด ขั้นตอนนี้นานนนนหน่อยนะคะ ใช้ไฟอ่อนสุดนะคะ ใช้มือกวาด ขั้นตอนนี้ก้อยใช้เวลา 4 ชั่วโมงคะ กวาดไปเรื่อยๆ จนกว่าจะเป็นหนามๆที่เมล็ดแตงคะ

3. ทำฐาน ผสมแป้งสาลี ไข่ และน้ำทีละนิดๆ จนแป้งเปนเนื้อเดียวกัน นวดแป้งให้เนียน พักแป้งไว้ 15 นาที

4. นำแป้งมาทำเป็นแผ่น แล้วใช้พิมพ์กด

5. นำแป้งกดในถ้วยตะไล ใช้ไม้จิ้มฟัน เจาะๆ กันแป้งพอง

6. นำแป้งไปอบ ก้อยใช้หม้อทอด ไฟ 150... อบเวลา 15 นาที พักแป้งให้เย็น

7. ผสมแป้งข้าวเจ้า แป้งท้าว แป้งมัน เกลือ ไข่แดง น้ำตาล และกะทิ เข้าด้วยกัน กรองแป้งลงกะทะ กวนแป้งไฟอ่อน จนแป้งสุก จับตัวเป็นก้อน พักให้แป้งอุ่น แล้วจึงนำไปขึ้นร่าง

8. นำแป้งปั่นรองฐาน วางลงบนแป้งฐาน นำเมล็ดแตงโมเสียบรอบๆ ปั่นแป้งเป็นวงกลม ทำร่องมะยม ก้อยทำ6แฉก จากนั้น ปั้นเมล็ดเล็กเป็นส่วนยอด แปะทองคำเปลว เป็นอันแล้วเสร็จ
    
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
