from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_69_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมคันหลาว, ขนมเล็บมือนาง, ขนมด้วง")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=500)

multi = """
ขนมคันหลาวและขนมเล็บมือนาง แท้จริงแล้วคือขนมชนิดเดียวกัน  เพียงแต่มีชื่อเรียกต่างกันไป ขึ้นอยู่กับท้องถิ่นและภูมิภาค  
  
- ขนมคันหลาว นิยมเรียกกันในภาคกลาง ภาคอีสาน และภาคเหนือ
- ขนมเล็บมือนาง นิยมเรียกกันในภาคใต้  
  
**ลักษณะของขนม**  

เป็นแป้งทำจากแป้งข้าวเจ้าผสมกับแป้งมัน นวดจนเนื้อเนียน นำมาคลึงเป็นเส้นยาวประมาณ 2 นิ้ว บีบปลายทั้งสองข้างให้แหลม คล้ายตัวแป้งขนมลอดช่อง มี 3 สี ขาว เขียว และชมพู
ราดด้วยกะทิ โรยด้วยงาขาว เนื้อสัมผัสเหนียวนุ่ม หวานมัน หอมกะทิ ขนมคันหลาวเป็นขนมมงคล นิยมใช้ในงานพิธีต่างๆ เช่น งานไหว้ครู งานมงคลคล้ายวันเกิด งานขึ้นบ้านใหม่
เชื่อกันว่าการกินขนมคันหลาวจะทำให้มีเสน่ห์และมีคนรัก ปัจจุบันขนมคันหลาวหาทานได้ยาก นิยมทำเฉพาะโอกาสพิเศษหรือตามร้านขนมไทยบางร้านเท่านั้น

"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    • แป้งข้าวเจ้า 1 ถ้วยครึ่ง  
    • แป้งมัน 1 ถ้วย  
    • น้ำใบเตย 1 ช้อนโต๊ะ  
    • น้ำกระเจี๊ยบ 1 ช้อนโต๊ะ  
    • น้ำเปล่า 3 ถ้วย  
    • มะพร้าวขูดคลุกเกลือพอออกรสเค็ม  
    

"""
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    1. ร่อนแป้งทั้งสองชนิดให้เข้ากันสักสองครั้ง แบ่งแป้งเป็น 3 ส่วนเท่า ๆ กัน  
    2. แป้งส่วนที่ 1 ใส่น้ำใบเตย 1 ช้อนโต๊ะ และน้ำเปล่า 1 ถ้วย ยกตั้งไฟอ่อนถึงกลาง กวนจนแป้งจับเป็นก้อน ร่อนออกจากกะทะ นวดแป้งเล็กน้อยจนแป้งนิ่มมือพักไว้  
    3. แป้งส่วนที่ 2 ใส่น้ำกระเจี๊ยบ 1 ช้อนโต๊ะ และน้ำเปล่า 1 ถ้วย ยกตั้งไฟอ่อนถึงกลาง กวนจนแป้งจับเป็นก้อน ร่อนออกจากกะทะ นวดแป้งเล็กน้อยจนแป้งนิ่มมือพักไว้  
    4. แป้งส่วนที่ 3 ใส่น้ำเปล่า 1 ถ้วย ยกตั้งไฟอ่อนถึงกลาง กวนจนแป้งจับเป็นก้อน ร่อนออกจากกะทะ นวดแป้งเล็กน้อยจนแป้งนิ่มมือพักไว้  
    5. นำมาคลึงให้เป็นเส้นกลมยาวประมาณ 2 นิ้ว คลึงปลายแป้งทั้งสองข้างให้ปลายแหลม  
    6. นำแป้งไปต้มในน้ำเชื่อมเดือดที่มีส่วนผสมของน้ำกับน้ำตาลทราย รอกระทั่งแป้งสุก ตัวขนมจะลอยขึ้นมา หรือนำไปนึ่งให้สุกประมาณ 10 นาที จนตัวแป้งมีลักษณะใสขึ้นก็ใช้ได้  
    7. นำแป้งสุกมาคลุกเคล้ากับเนื้อมะพร้าวทึนทึกขูดที่ผ่านการนึ่งมาแล้ว เจือเกลือป่นเข้ากับมะพร้าวพอให้ออกรสเค็มเล็กน้อย  
    หมายเหตุ: ขนมคันหลาวนี้สามารถใส่หัวกะทิผสมน้ำตาลทรายเล็กน้อย ราดบนตัวขนมให้มีน้ำขลุกขลิก และโรยด้วยงาคั่วให้มีสีสันและกลิ่นหอมน่ารับประทานก็ได้
        
    """
    st.markdown(multi)

st.page_link("Home.py", label="Home", icon="↩️")
