from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_79_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมเจาะหู")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
 ขนมเจาะหู หรือที่รู้จักกันในชื่ออื่นๆ เช่น ขนมดีซำ แบซำ โดซีแย หรือ 
 ลีงอโต๊ะแว เป็นขนมพื้นบ้านภาคใต้ที่มีเอกลักษณ์โดดเด่นด้วยรูปร่างกลม 
 คล้ายโดนัท แต่มีรูตรงกลาง นิยมทำขึ้นเพื่อใช้ในช่วงเทศกาลสำคัญทางศาสนาพุทธ
 และศาสนาอิสลาม ขนมเจาะหูมีต้นกำเนิดมาจากทางภาคใต้ของประเทศไทย 
 แต่ละท้องถิ่นมีสูตรและวิธีการทำที่แตกต่างกันเล็กน้อย 
 เชื่อกันว่าขนมชนิดนี้มีมานานหลายร้อยปีในอดีตนิยมทำขนมเจาะหูในช่วง
 เทศกาลฮารีรายอของชาวมุสลิม และงานบุญสารทเดือนสิบของชาวไทยพุทธ  
  
ขนมเจาะหูมีรูปร่างคล้ายเบี้ยหอย 
ซึ่งในสมัยโบราณนิยมใช้เบี้ยหอยเป็นเครื่องแลกเปลี่ยน 
เปรียบเสมือนเงินด้วยรูปลักษณ์นี้ จึงมีความเชื่อกันว่าขนมเจาะหูเ
ป็นสัญลักษณ์แทนเงินทองในงานบุญสารทเดือนสิบ 
ชาวบ้านจะนำขนมเจาะหูไปทำบุญอุทิศส่วนกุศลให้กับบรรพบุรุษ 
เปรียบเสมือนการส่งเงินทองให้ท่านใช้ในอีกภพภูมิหนึ่งขนมเจาะหูยัง
เป็นส่วนหนึ่งของพิธีกรรมต่างๆ ในงานประเพณีท้องถิ่น เช่น ประเพณีลอยกระทง 
ปัจจุบันขนมเจาะหูหาซื้อได้ยากขึ้น แต่ยังพอมีบ้างตามร้านขายขนมพื้นบ้านในภาคใต้บาง
ท้องถิ่นมีการพัฒนาสูตรและวิธีการทำขนมเจาะหูให้หลากหลายมากขึ้นขนมเจาะหูยังคง
เป็นขนมที่มีความหมายและคุณค่าทางวัฒนธรรม 
สะท้อนให้เห็นถึงความเชื่อและประเพณีดั้งเดิมของชาวไทยภาคใต้  

"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    • แป้งข้าวเจ้า 1 กิโลกรัม  
    • แป้งข้าวเหนียว 200 กรัม  
    • แป้งหมี่ 100 กรัม  
    • น้ำตาลโตนด 1/2 กิโลกรัม  
    • น้ำตาลทรายแดง 1/2 กิโลกรัม  
    • เกลือป่น /2 ช้อนชา  
    • ใบเตย 6 ใบ  
    • น้ำมันพืชใส่ในแป้ง 1 ช้อนโต๊ะ  
    • น้ำมันพืชสำหรับทอด 2 ลิตร  
    • ไม้เขี่ยขนม  
    • ใบตองสำหรับรองแป้ง   


    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    1. เคี่ยวน้ำตาลทรายตามสูตร ใส่เกลือป่นลงไป พอละลาย ยกลง พักไว้ให้เย็น  
    2. นำแป้งทั้งหมดใส่ในอ่างผสม ตามด้วยน้ำตาลที่เคี่ยว นวดผสมให้เข้ากัน และใส่น้ำมันพืชลงไปนวดอีกครั้ง พักแป้งไว้ 1 คืน ปิดฝาให้สนิทด้วยนะ ป้องกันมด  
    เคล็ดลับ: ใครชอบงา สามารถใส่งาขาวลงไปในแป้งได้เลย  
    3. นำใบตองมารองแป้งดังรูป ทาน้ำมันให้ทั่ว หยิบแป้งประมาณ 1 ก้อนเท่าหัวนิ้วโป้ง มากดให้แบนด้วยนิ้ว และใช้นิ้วเจาะรูตรงกลาง  
    4. นำใบตองที่มีแป้งเป็นรูแล้ว มาใกล้กระทะ หยิบแป้งใส่ลงไปในกระทะที่มีน้ำมัน ใช้ไฟกลางในการทอด  
    5. นำไม้มาหมุนวนในรูตรงกลางเร็วๆ แต่เบา ขณะที่แป้งยังไม่แข็งตัว  
    6. จนเป็นวงกลมดังรูป( ทำแบบนี้ วนไป จนแป้งหมด )  
    7. เมื่อสุกแล้ว ใช้ไม้ตักขึ้น ไปวางในกระชอนให้สะเด็ดน้ำมัน พร้อมทานแล้วครับ  
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
