from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_216_PATH1")

# Set page configuration
st.set_page_config(
    page_title="ขนมเสน่ห์จันทร์: เอกลักษณ์ความหอมละมุน กลมกล่อม น่ารับประทาน",
    page_icon="🍬",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(image=header_img_path)
# Display title
st.title("ขนมเสน่ห์จันทร์: เอกลักษณ์ความหอมละมุน กลมกล่อม น่ารับประทาน")
st.image(kanom_img_path)
st.title("ประวัติความเป็นมา")
with st.expander("ประวัติความเป็นมา"):
    st.markdown(
        """
        ขนมเสน่ห์จันทร์ ขนมไทยโบราณที่ขึ้นชื่อเรื่องความหอมละมุน กลมกล่อม น่ารับประทาน มีเอกลักษณ์เฉพาะตัวด้วยสีเหลืองนวล เนื้อสัมผัสนุ่มฟู และรสชาติหวานมัน นิยมทำในงานมงคลต่างๆ งานฉลองต่างๆ หรือแม้กระทั่งทานเล่นในชีวิตประจำวัน
        """
    )

st.title("ประวัติความหมาย")
with st.expander("ประวัติความหมาย"):
    st.markdown(
        """
        - **เสน่ห์จันทร์:** มาจากลักษณะของขนมที่มีสีเหลืองนวล คล้ายกับพระจันทร์ บวกกับความเชื่อที่ว่าการทานขนมชนิดนี้จะช่วยเพิ่มเสน่ห์ ดึงดูดผู้คนให้มารักใคร่เอ็นดู
        """
    )

st.title("สูตรขนมเสน่ห์จันทร์")
with st.expander("สูตรขนมเสน่ห์จันทร์"):
    st.markdown(
        """
        **วัตถุดิบ:**
        - แป้งสาลีอเนกประสงค์ 100 กรัม
        - แป้งเท้ายายม่อม 10 กรัม
        - ไข่ไก่ 6 ฟอง (ใช้เฉพาะไข่แดง)
        - หัวกะทิ 230 กรัม
        - น้ำตาลทราย 160 กรัม
        - สีผสมอาหารสีเหลือง และสีน้ำตาลเล็กน้อย
        - เทียนอบขนม

        **วิธีทำ:**
        1. ตีไข่แดงกับน้ำตาลทรายเข้าด้วยกัน ร่อนแป้งสาลี และแป้งเท้ายายม่อมใส่ลงไป แต่งด้วยสีเหลืองเล็กน้อย ตีให้เข้ากันดี ใส่กะทิลงไปทีละน้อยจนหมด กรองส่วนผสมใส่กระทะทอง ยกขึ้นตั้งไฟอ่อน กวนจนแป้งจับตัวกันเป็นก้อนเนียนใส คลุมส่วนผสมด้วยผ้าขาวบางจนพอ อุ่นดี
        2. เทส่วนผสมลงพิมพ์กลม โรยหน้าด้วยเกลือเล็กน้อย นำไปอบด้วยไฟปานกลางประมาณ 20 นาที หรือจนขนมสุก
        3. นำขนมออกจากเตา รอให้เย็น ตัดเป็นชิ้นพอดีคำ โรยหน้าด้วยเกลือเล็กน้อย ตกแต่งด้วยเทียนอบขนม

        **เคล็ดลับ:**
        - การเลือกแป้งสาลี: ควรเลือกแป้งสาลีอเนกประสงค์ จะได้เนื้อขนมนุ่มฟู
        - การตีไข่แดง: ควรตีไข่แดงกับน้ำตาลทรายจนฟู จะได้เนื้อขนมเบา
        - การกวนแป้ง: ควรค่อยๆ เทกะทิลงไป กวนจนแป้งจับตัวกันเป็นก้อนเนียนใส จะได้เนื้อขนมเนียน
        - การอบขนม: ควรอบด้วยไฟปานกลาง ระวังไม่ให้น้ำตาลไหม้
        """
    )

st.page_link("Home.py", label="Home", icon="↩️")
