from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_63_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมไข่ปลา")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=500)

multi = """
ขนมไข่ปลา มีต้นกำเนิดมาจากพิธีกรรมทางศาสนา ในอดีตมักจะทำ 
ขนมไทยมงคล เมนูนี้ประกอบในเทศกาลสำคัญ เพื่อกราบไหว้บรรพบุรุษ 
และทำถวายวัดในงานบุญประเพณีต่างๆ จนเวลาต่อมาก็ได้มีการดัดแปลง 
สูตรขนมไทย เพื่อให้อร่อยเข้ากับยุคสมัยมากยิ่งขึ้น
โดยยังคงใช้วัตถุดิบที่หาได้ง่ายในท้องถิ่น 
และทำขึ้นเพื่อเลี้ยงแขกบ้านแขกเมือง  
  
แม้จะขึ้นชื่อว่าเป็นหนึ่งใน ขนมไทยโบราณ แต่ ขนมไข่ปลา 
นั้นมีความพิเศษแปลกใหม่ ไม่แพ้ขนมไทยยอดนิยม 
เรียกได้ว่าเป็น ขนมโบราณ ที่ไม่โบราณสมชื่อ รสชาตินั้นอร่อยล้ำไปไกลมาก 
ในหนึ่งชิ้นประกอบด้วยรสชาติ หวาน มัน เค็ม เนื้อสัมผัสเหนียวนุ่มกำลังดี 
กรุบเนื้อมะพร้าวทึนทึก ผสานกลิ่นหอมซึ่งเป็นเอกลักษณ์ของเนื้อตาล 
ใครได้ทานสักครั้งต่างต้องติดใจกันทุกๆราย


"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    **ตัวขนมไข่ปลา**  
    • เนื้อตาลสุก 4 ช้อนโต๊ะ  
    • มะพร้าวทึนทึกขูดนึ่ง ปริมาณตามชอบ  
    • น้ำเปล่า  
  
    
**วัตถุดิบทำ น้ำเชื่อม**  
    • น้ำเปล่า 500 มิลลิลิตร  
    • น้ำตาลทราย 1 ถ้วยตวง  
    • ใบเตย 1 มัด  
    • เกลือ 1/2 – 1 ช้อนชา  

"""
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    **ขั้นตอนวิธีการทำ ขนมไข่ปลา โรยหน้ามะพร้าวทึนทึก**  
    1. ขั้นตอนแรกในการทำ ขนมไข่ปลา เริ่มจากการใส่แป้งทั้งสองชนิด คือ แป้งข้าวเหนียว และแป้งข้าวเจ้าลงไปในชามผสม ตามด้วยเนื้อตาลสุก จากนั้นนวดคลุกเคล้าให้ส่วนผสมเข้ากันเป็นเนื้อเดียวกันจนสามารถปั้นได้ ระหว่างนวดให้ทยอยใส่น้ำลงไปเล็กน้อย เพื่อให้ส่วนผสมไม่แห้งจนเกินไป เสร็จแล้วห่อชามผสมด้วยฟิล์มถนอมอาหาร พักไว้เป็นเวลา 20 นาที เพื่อให้แป้งอิ่มน้ำ และนิ่มมากยิ่งขึ้น  
    2. ระหว่างรอให้นำเนื้อมะพร้าวทึนทึกมาห่อด้วยผ้าขาวบาง ก่อนจะนึ่งให้ร้อนเป็นเวลา 5 นาที เพื่อป้องกันไม่ให้มะพร้าวเสียง่าย  
    3. เมื่อพักแป้งไว้จนครบเวลาแล้วให้ปั้นขนมเป็นรูปไข่ปลา โดยปั้นให้เป็นเส้นแล้วบีบปลายเส้นเข้าหากันให้เป็นรูปเป็นร่าง ปั้นต่อจนกว่าส่วนผสมที่เตรียมไว้จะหมด  
    4. ใส่น้ำเปล่า และน้ำตาลทรายลงไปในหม้อ ก่อนจะเปิดเตาด้วยไฟอ่อนค่อนกลาง ใส่ใบเตยลงไปเคี่ยวด้วยกันจนกว่าส่วนผสมจะละลายทั้งหมด จากนั้นแบ่งน้ำเชื่อมส่วนหนึ่ง (ประมาณ 3 ทัพพี) ใส่ชามผสม ผสมน้ำเปล่าลงไปเล็กน้อย เพื่อเก็บไว้แช่ขนมไข่ปลา เสร็จแล้วให้ปรุงรสน้ำเชื่อมในหม้อด้วยเกลือเล็กน้อย คนให้ละลายเข้ากัน  
    5. ปรับไฟเป็นอ่อนแล้วนำตัว ขนมไข่ปลา ที่เตรียมไว้ใส่ลงไปต้มในหม้อ เมื่อด้านที่โดนน้ำสุกแล้วให้กลับด้านขนม ทำการต้มต่อจนกว่าจะสุกดี และนำไปแช่ในน้ำเชื่อมที่แบ่งไว้เป็นเวลา 10 นาที เพื่อให้ตัวขนมเงางามขึ้น  
    6. ตักตัวขนมไข่ปลาที่เตรียมไว้มาคลุกกับเนื้อมะพร้าวทึนทึกขูดฝอย ก่อนจะนำไปจัดใส่จานให้สวยงาม เป็นอันเสร็จสิ้น รับประทานได้เลยค่ะ  
    

    
    """
    st.markdown(multi)

st.page_link("Home.py", label="Home", icon="↩️")
