from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_100_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมตาล")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
ขนมตาลเป็นขนมไทยขึ้นชื่อของเมืองเพชรบุรี (ขนมเมืองเพชร) มีมาตั้งแต่สมัยสุโขทัยถึงสมัยอยุธยาตอนต้น หลักฐานเกี่ยวกับการใช้ประโยชน์จากต้นตาลที่เก่าแก่ที่สุด คือ ตราประทับดินเผารูปคนปีนต้นตาล สมัยทวารวดี พบที่เมืองโบราณจันเสน จังหวัดนครสวรรค์ แสดงถึงการใช้ประโยชน์จากต้นตาลของผู้คนในดินแดนสุวรรณภูมิมาเนิ่นนานก่อนหน้านี้
 
"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    การเตรียมเนื้อตาลสุก  
    1.ลูกตาลสุก 2 ลูก  
    2.น้ำสะอาดสำหรับล้างเนื้อตาล  
    3.เกลือ 3 ช้อนโต๊ะ  
    4.กระทงใบตองสำหรับใส่ขนมตาล  
    
    วัตถุดิบในการทำขนมตาล  
    1.แป้งข้าวเจ้า 300 กรัม  
    2.เนื้อตาลยี 200 กรัม  
    3.หัวกะทิ 600 กรัม  
    4.ผงฟู 1 1/2 ช้อนชา  
    ๕.น้ำตาลทรายขาว 300 กรัม  
    6.เกลือป่น 1/2 ช้อนชา  
    7.เนื้อมะพร้าวทึนทึกขูดเส้น ปริมาณตามชอบ  


    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
ขั้นตอนวิธีเตรียมเนื้อตาลสด  
1.นำลูกตาลสดไปล้างน้ำให้สะอาด จากนั้นดึงขั้วตาลออกแล้วใช้มีดปลอกเปลือก และใช้มือดึงเปลือกสีดำออกให้หมด ดึงแกนแข็ง ๆ หรือใจตาลออก (ส่วนนี้หากแยกออกไม่หมดจะทำให้เนื้อตาลมีรสขม และเฝื่อน) และแยกส่วนของผลตาลใส่ในชามผสม  

2.ล้างเนื้อตาล เติมน้ำใส่ลงไปให้ท่วม ตามด้วยเกลือ (ช่วยลดความขม และเฝื่อนของเนื้อตาล) จากนั้นใช้มือคั้น และยีให้เนื้อตาลออกมาได้มากที่สุด เสร็จแล้วนำไปกรองด้วยตะแกรงใส่ลงในภาชนะอีกหนึ่งใบ  

3.นำเนื้อตาลในภาชนะที่ผ่านการกรองแล้ว มาเทใส่ผ้าขาวบางทบ 2 ชั้น รองด้วยตะแกรง และรองด้วยชามผสม ทำการรวบผ้าเข้าหากันแล้วมัดไว้ ทิ้งไว้ 1 คืน เพื่อให้น้ำที่ปนอยู่ในเนื้อตาลไหลออกมาให้หมด เมื่อรอจนครบเวลา วิธีเก็บเนื้อตาลที่ยีแล้ว ให้นำไปใส่ในบรรจุภัณฑ์ที่มีฝาปิด เพื่อนำไปเป็นวัตถุดิบในการทำขนมต่อไป  
  
ขั้นตอนวิธีทำขนมตาล  
1.เทกระทิใส่ชามผสม ตามด้วยน้ำตาลทราย คนให้เข้ากันจนน้ำตาลละลาย  
2.ใส่เนื้อลูกตาลสุก และตีให้เข้ากัน  
3.ใส่แป้งข้าวเจ้าลงไป ผงฟู และเกลือ ตีให้เข้ากัน จากนั้นกรองเพื่อให้เนื้อแป้งเนียนขึ้น จากนั้นพักแป้งไว้ 6 ชั่วโมง หรือหนึ่งคืน เพื่อให้แป้งเซตตัว  
4.หยอดแป้งลงไปจนเต็มกระทงใบตอง  
5.นำเนื้อมะพร้าวขูดฝอยมาคลุกเคล้าให้เข้ากันกับเกลือแล้วโรยหน้าขนม  
6.นำไปนึ่งด้วยไฟแรงจัดเป็นเวลา 25 นาที เสร็จแล้วยกออกจากเตาพักไว้ให้เย็น และนำไปรับประทานได้เลย  
    
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
