from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_KhanomKlipLamduan_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("กลีบลำดวน")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
กลีบลำดวนเป็นขนมไทยที่เป็นที่รู้จักกันมาอย่างช้านาน 
มีรสหวาน มัน เค็ม นิด ๆ ละลายในปาก ด้วยรูปลักษณ์ภายนอกที่ถูกรังสรรค์ให้เหมือนดอกลำดวนจึงเป็นที่มาของ
ชื่อขนมชนิดนี้ ขนมกลีบลำดวน สมัยก่อนหากมีงานมงคลมักจะใช้ขนมชนิดนี้ 
นำมาประกอบพิธีร่วมกับขนมชนิดอื่น ๆ ที่เป็นขนมมงคล 
เนื่องด้วยคนโบราณมีความเชื่อกันว่า "ขนมกลีบลำดวน" มีความหมายที่ดี 
ช่วยทำให้ชื่อเสียงขจรขจายไปไกลและยังมีความหมาย 
สร้างความงดงามให้กับชีวิต อาจจะเป็นด้วยลักษณ์ของขนมกลีบลำดวน 
ที่มีกลีบดอกสามกลีบ นำมาประสานติดกัน 
ปั้นเกสรวางไว้ตรงกลางทำให้ขนมแลดูงดงามเหมือนดั่งดอกลำดวน 
ดอกลำดวนนั้นเป็นดอกไม้ที่มีเสน่ห์ยามค่ำคืน จะส่งกลิ่นหอมอบอวล 
ถือเป็นเอกลักษณ์เฉพาะตัว
"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
        1. แป้งอเนกประสงค์ 380 กรัม

        2. น้ำตาลไอซิ่ง 150 กรัม

        3. เกลือ 2 ช้อนชา

        4. น้ำมันพืช 150 มิลลิลิตร

        5. สีผสมอาหารสีชมพู ¼ ช้อนชา 
"""
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    STEP 1 : เตรียมแป้ง 

    1. วอร์มเตาอบโดยใช้ไฟบน และล่างที่อุณหภูมิ 160 องศาเซลเซียส

    2. นำแป้งอเนกประสงค์ มาร่อนกับน้ำตาลไอซิ่ง 2 - 3 ครั้ง เพื่อให้ขนมร่วน และเบา

    3. นำแป้งที่ร่อนแล้วมาผสมเกลือ และทยอยเทน้ำมันลงไปทีละน้อย คนเบา ๆ ไปเรื่อยจนเนื้อแป้งเกาะกัน
    
    4. แบ่งแป้งเป็น 2 ถ้วย โดยถ้วยแรกมีปริมาณ ¾ ของแป้งทั้งหมด ส่วนถ้วยที่สองคือแป้งส่วนที่เหลือ 
    นำแป้งถ้วยที่สองมาผสมกับสีผสมอาหารสีชมพูจนเข้ากันดี พักแป้งทั้งสองถ้วยประมาณ 10 - 15 นาที 

    STEP 2 : ขึ้นรูป + อบขนม

    1. นำแป้งสีขาวมาปั้นเป็นก้อนกลมขนาดปริมาณ 20 กรัม ตัดออกเป็น 4 ส่วน แต่เราจะใช้แค่ 3 ส่วน มาประกอบสามกลีบ
    
    2. นำแป้งสีชมพูมาปั้นเป็นก้อนกลมเล็ก ๆ ขนาดปริมาณ 5 กรัม เพื่อนำไปวางตรงกลางเป็นเกสร
    
    3. นำ “ขนมกลีบลำดวน” เข้าอบที่อุณหภูมิ 160 องศาเซลเซียส นาน 15 นาที จากนั้นนำออกมาพักให้เย็น


    STEP 3 : จัดเสิร์ฟ

    นำ “ขนมกลีบลำดวน” ที่พักจนเย็นแล้วมาจัดเสิร์ฟใส่จาน อาจจะเสิร์ฟคู่น้ำชา หรือเครื่องดื่มตามชอบได้เลย
    
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
