from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_193_PATH1")

# Set page configuration
st.set_page_config(
    page_title="ขนมลืมกลืน: เอกลักษณ์ความอร่อย หอม หวาน ละมุนลิ้น",
    page_icon="🍬",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมลืมกลืน: เอกลักษณ์ความอร่อย หอม หวาน ละมุนลิ้น")
st.image(image=kanom_img_path)

st.title("ที่มาของชื่อ")
with st.expander("ที่มาของชื่อ"):
    st.markdown(
        """
        ขนมลืมกลืน มีที่มาที่ไปสันนิษฐานไว้ 2 ประการ ดังนี้
        1. เนื้อสัมผัส: ลักษณะของตัวขนมมีเนื้อนุ่ม ละมุนละลายในปาก ทานง่ายจนเผลอลืมกลืน
        2. รสชาติ: ความอร่อย หอม หวาน กลมกล่อม ลงตัวจนหยุดทานไม่ได้ เผลอลืมกลืนคำแล้วคำเล่า
    """
    )

st.title("สูตรและส่วนผสม")
with st.expander("สูตรและส่วนผสม"):
    st.markdown(
        """
        **ตัวขนม**
        - แป้งถั่วเขียว 70 กรัม
        - แป้งท้าวยายม่อม 1 ช้อนชา
        - น้ำตาลทราย 165 กรัม
        - น้ำเปล่า 620 กรัม
        - กลิ่นมะลิ 1 ช้อนชา
        - เกลือป่น 1/8 ช้อนชา

        **หน้ากะทิ**
        - กะทิ 200 มล.
        - แป้งข้าวเจ้า 1 ช้อนโต๊ะ
        - เกลือ 1/4 ช้อนชา
        - น้ำตาลทราย 2 ช้อนโต๊ะ

        **วิธีทำ**
        1. ตัวขนม: ผสมแป้งถั่วเขียว แป้งท้าวยายม่อม น้ำตาลทราย เกลือ และน้ำเปล่า คนให้เข้ากันจนละลายดี นำไปตั้งไฟปานกลาง คนเรื่อยๆจนแป้งข้นเหนียวและใส
        2. แบ่งแป้ง: แบ่งแป้งเป็น 3 ส่วน เติมสีผสมอาหารตามต้องการ (สีเขียว, สีเหลือง, สีชมพู)
        3. หยอดตัวขนม: นำแป้งแต่ละสีใส่ถุงบีบ บีบลงบนใบตองหรือพิมพ์ที่เตรียมไว้ พักให้เย็น
        4. หน้ากะทิ: ผสมกะทิ แป้งข้าวเจ้า เกลือ และน้ำตาลทราย คนให้เข้ากัน ตั้งไฟปานกลาง คนจนกะทิข้นเหนียว
        5. แต่งหน้าขนม: ราดหน้ากะทิบนตัวขนม โรยหน้าด้วยถั่วเขียวคั่ว
    """
    )

st.title("หมายเหตุ")
with st.expander("หมายเหตุ"):
    st.markdown(
        """
        - สูตรและส่วนผสมสามารถปรับได้ตามความชอบ
        - ควรเลือกใช้ใบตองสด หรือพิมพ์ที่ทนความร้อน
        - ทานขนมลืมกลืนพร้อมน้ำชาหรือน้ำเก๊กฮวย จะช่วยเพิ่มรสชาติให้กลมกล่อมยิ่งขึ้น
    """
    )

st.title("คุณค่าทางโภชนาการ")
with st.expander("คุณค่าทางโภชนาการ"):
    st.markdown(
        """
        ขนมลืมกลืน ให้พลังงานจากคาร์โบไฮเดรต และวิตามินจากถั่วเขียว
    """
    )

st.page_link("Home.py", label="Home", icon="↩️")
