from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_213_PATH1")

# Set page configuration
st.set_page_config(
    page_title="ขนมสาลี่: เอกลักษณ์ความนุ่มฟู หอมหวาน กลมกล่อม",
    page_icon="🌸",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(image=header_img_path)
# Display title
st.title("ขนมสาลี่: เอกลักษณ์ความนุ่มฟู หอมหวาน กลมกล่อม")
st.image(kanom_img_path)
st.title("ประวัติความเป็นมา")
with st.expander("ประวัติความเป็นมา"):
    st.markdown(
        """
        ขนมสาลี่ ขนมไทยโบราณที่ขึ้นชื่อเรื่องความนุ่มฟู หอมหวาน กลมกล่อม นิยมทำในงานมงคลต่างๆ หรือแม้กระทั่งทานเล่นในชีวิตประจำวัน

        **ประวัติความเป็นมา:**
        ขนมสาลี่ มีต้นกำเนิดมาจากจีน แต่เข้ามาเผยแพร่ในประเทศไทยตั้งแต่สมัยกรุงศรีอยุธยา นิยมทำในงานมงคล งานฉลองต่างๆ หรือแม้กระทั่งทานเล่นในชีวิตประจำวัน
        """
    )

st.title("ความหมายมงคลนาม")
with st.expander("ความหมายมงคลนาม"):
    st.markdown(
        """
        - **สาลี่:** ผลไม้ที่มีรูปร่างคล้ายเรือ เปรียบเสมือนความราบรื่น มั่งคง
        - **สีเหลือง:** ของขนมสาลี่ เปรียบเสมือนสีทอง โชคลาภ
        """
    )

st.title("สูตรขนมสาลี่")
with st.expander("สูตรขนมสาลี่"):
    st.markdown(
        """
        **วัตถุดิบ:**
        - แป้งสาลีอเนกประสงค์ 250 กรัม
        - ผงฟู 1 ช้อนชา
        - เกลือ 1/4 ช้อนชา
        - ไข่ไก่ 3 ฟอง
        - น้ำตาลทราย 150 กรัม
        - น้ำมันพืช 100 มิลลิลิตร
        - นมสด 100 มิลลิลิตร
        - กลิ่นวานิลลา 1 ช้อนชา
        - ลูกเกด (สำหรับโรยหน้า)

        **วิธีทำ:**
        1. ร่อนแป้งสาลี ผงฟู และเกลือ เข้าด้วยกัน
        2. ตีไข่ไก่กับน้ำตาลทรายจนฟู ใส่เกลือ กลิ่นวานิลลา ตีต่อจนเข้ากัน
        3. ค่อยๆ เทส่วนผสมแป้งลงในส่วนผสมไข่ สลับกับนมสด คนจนเข้ากันดี
        4. ใส่ลูกเกดลงในแป้ง คนให้เข้ากัน
        5. เทส่วนผสมลงในพิมพ์ ทาน้ำมันบางๆ
        6. นำไปนึ่งด้วยไฟปานกลางประมาณ 30 นาที หรือจนขนมสุก

        **เคล็ดลับ:**
        - การเลือกแป้งสาลี: ควรเลือกแป้งสาลีอเนกประสงค์ จะได้เนื้อขนมนุ่มฟู
        - การตีไข่ไก่: ควรตีไข่ไก่กับน้ำตาลทรายจนฟู จะได้เนื้อขนมเบา
        - การนึ่งขนม: ควรนึ่งด้วยไฟปานกลาง ระวังไม่ให้น้ำเดือดพล่าน
        """
    )

st.title("ข้อมูลเพิ่มเติม")
st.markdown(
    """
    ขนมสาลี่ เป็นขนมไทยที่ไม่เพียงแต่อร่อย แต่ยังมีความสำคัญในภูมิปัญญาไทย และเสน่ห์ทางวัฒนธรรมที่น่าสนใจ
    """
)

st.page_link("Home.py", label="Home", icon="↩️")
