from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_65_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมไข่หงส์, ไข่เหี้ย")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=500)

multi = """
ขนมไข่หงส์หรือชื่อเดิม **ขนมไข่เหี้ย** มีเรื่องเล่าว่า ในสมัยของพระพุทธยอดฟ้าจุฬาโลกมหาราช รัชกาลที่ 1 มีพระประสงค์ที่ต้องการจะเสวยไข่ของตัวเงินตัวทอง ซึ่งสมัยนั้นนิยมทานกับมังคุด แต่ในช่วงเวลานั้นขาดแคลน 
เจ้าจอมแว่นซึ่งเป็นพระสนมเอกในรัชกาลที่ 1 จึงทำขนมชนิดนี้ถวาย



"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    **ไส้**  
    • ถั่วเขียวเลาะเปลือก 200 กรัม  
    • รากผักชี 10 ราก  
    • กระเทียมไทย 10 กลีบ  
    • พริกไทยขาวเม็ด 3 ช้อนโต๊ะ  
    • น้ำมันรำข้า 3 ช้อนโต๊ะ  
    • น้ำตาลทราย 5 ช้อนโต๊ะ  
    • น้ำตาลมะพร้าว 50 กรัม  
    • น้ำปลา 2 ช้อนโต๊ะ  
    • เกลือ 1 ช้อนชา  
    • น้ำมันรำข้าวสำหรับทอด  
      
    **แป้ง**  
    • มันฝรั่งนึ่งสุกบด 230 กรัม  
    • แป้งข้าวเหนียว 400 กรัม  
    • แป้งข้าวเจ้า 120 กรัม  
    • น้ำตาลทราย 200 กรัม  
    • กะทิ 125 มิลลิลิตร  
    • น้ำสะอาด 235 มิลลิลิตร  
    • มะพร้าวขูดขาว 135 กรัม  
      
    **น้ำตาลฉาบ**   
    • น้ำตาลทราย 400 กรัม  
    • น้ำปูนใส 180 มิลลิลิตร  

"""
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    1. ล้างทำความสะอาดถั่วเขียวเราะเปลือก แช่น้ำเป็นเวลา 3 ชั่วโมง สะเด็ดน้ำ ห่อด้วยผ้าขาวบางชุบน้ำหมาดๆ นำไปนึ่งให้สุกดี ประมาณ 30 นาที นำไปปั่นในเครื่องบดสับหยาบๆ พักไว้

    2. ทำไส้ โดยโขลกรากผักชี กระเทียม และพริกไทยเม็ดเข้าด้วยกัน นำลงไปผัดกับน้ำมันรำข้าว ให้หอมดี ใส่ถั่วเขียวเราะเปลือกที่พักไว้ลงไป ปรุงรสด้วยน้ำตาลทราย น้ำตาลมะพร้าว น้ำปลา และเกลือ ผัดให้ส่วนผสมแห้ง และเหนียวพอที่จะปั้นเป็นก้อน พักให้เย็นลง ปั้นเป็นก้อนขนาด 2 ช้อนชา พักไว้

    3. ทำแป้งโดย ผสมแป้งข้าวเหนียว แป้งข้าวเจ้า และมันฝรั่งบด นวดพอเข้ากัน (การใส่มันฝรั่งจะช่วยทำให้เวลาทอดแป้งไม่แตก) ใส่กะทิ น้ำตาลทราย และมะพร้าวขูด นวดต่อ สุดท้ายจึงใส่น้ำสะอาดลงไปทีละครึ่งจนหมด นวดส่วนผสมให้เนียนดี พักเป็นเวลา 10 นาที

    4. ปั้นแป้งเป็นก้อนกลมกดให้แบนลง ใส่ไส้ที่พักไว้ลงตรงกลาง ห่อให้มิดดี (เวลาปั้นไม่จำเป็นต้องคลึงให้กลมมากเพราะจะทำให้แตกเวลาทอด)

    5. ตั้งน้ำมันสำหรับทอดที่ 160 องศาเซลเซียส นำขนมลงทอดประมาณ 5-7 นาที จนแป้งมีสีเหลืองทอง ตักขึ้นจากน้ำมัน พักไว้

    6. ทำน้ำตาลฉาบ โดยผสมน้ำปูนใส และน้ำตาลทรายเข้าด้วยกัน นำขึ้นตั้งไฟเคี่ยวจนเป็นยางมะตูม หรือน้ำเชื่อมมีอุณหภูมิ 116 องศาเซลเซียส ใส่ขนมที่ทอดแล้วลงไป คลุกจนน้ำเชื่อมเกาะตัวขนม และตกผลึก ตักขึ้น พักให้เย็นลง (การใช้น้ำปูนใสจะช่วยทำให้น้ำตาลฉาบไม่ละลายหลังจากที่เคลือบขนมแล้ว)

    
    """
    st.markdown(multi)

st.page_link("Home.py", label="Home", icon="↩️")
