from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_86_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมช่อมะลิซ้อน")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
ขนมช่อมะลิซ้อน  เป็นขนมไทยโบราณที่มีลักษณะคล้ายกับ 
ขนมช่อม่วง แต่มีเอกลักษณ์ที่โดดเด่นคือ มีไส้ 2 ชั้น 
ชั้นแรกเป็นไส้ถั่วกวน ชั้นที่สองเป็นไส้กุ้งสับ ที่มาของชื่อ 
ขนมช่อมะลิซ้อน สันนิษฐานว่า 
น่าจะได้ชื่อมาจากรูปลักษณ์ของขนมที่มีไส้ 2 ชั้น ซ้อนทับกัน   
คล้ายกับกลีบดอกมะลิที่ซ้อนกันอยู่หลายชั้น
 
"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    ส่วนผสม สามเกลอ  
    • รากผักชี 3-4  
    • กระเทียม 15 กรัม  
    • พริกไทยขาวป่น 1 ช้อนชา  
    

    ไส้กุ้ง  
    • กุ้งสับ 100 กรัม  
    • หมูติดมันสับ 100 กรัม  
    • น้ำตาลมะพร้าว 1 ช้อนโต๊ะ  
    • ซีอิ๊วขาว 3 ช้อนชา  
    • แป้งสาลี 2 ช้อนชา  
    • น้ำมันพืช 2 ช้อนชา  
    • หอมใหญ่สับ 40 กรัม  
    
    แป้งช่อมะลิ  
    • แป้งข้าวเจ้า 1 ถ้วย  
    • แป้งข้าวเหนียว 1 ช้อนโต๊ะ  
    • แป้งท้าวยายม่อม 1 ช้อนโต๊ะ  
    • แป้งมัน 1 ช้อนโต๊ะ  
    • น้ำมันรำข้าว 1 ช้อนโต๊ะ  

    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    1. ตั้งน้ำมัน พอร้อนกลางๆ นำสามเกลอลงผัด จนกลิ่นหอม ใส่หอมใหญ่ ผัดจนหอมใสๆ ใส่กุ้งสับ หมูสับลงไปผัดจนสุก (สามารถเปลี่ยนจากหมูเป็นไก่ ได้เช่นกัน โดยส่วนตัวเคยใช้กุ้งล้วน แต่รูสึกว่ากุ้งล้วนจะนิ่มเกินไป เลยปรับสูต่เป็นผสมหมูบดเพื่อให้มีความหนึบๆ) ปรุงรสด้วยซีอิ๊วขาว น้ำตาลมะพร้าว คนจนเข้ากัน ใส่แป้งสาลีลงไป เผื่อให้ไส้จับตัวกัน นำไส้ออกมาพักให้หายร้อน  
    2. ขั้นตอนต่อไป ทำตัวแป้ง นำแป้งข้าวเจ้า แป้งมัน แป้งท้าว และแป้งข้าวเหนียวผสมกัน ใส่น้ำกะทิ น้ำลอยดอกมะลิ คนจนแป้งเป็นเนื้อเดียวกัน ใส่น้ำมันรำข้าว  
    3. กรองแป้งใส่ในกระทะเทฟรอน ตั้งไฟกลางๆ กวนแป้งจนแป้งจับตัวเป็นก้อน ปิดไฟ นวดต่อ จนแป้งเนียนเป็นเนื้อเดียวกัน นำแป้งออกมาพักให้หายร้อน  
    4. เราใช้แหนบ 2 แบบ แบบใบไม้สำหรับจีบกลีบบน แบบแบน สำหรับจีบฐานกลีบ ควรเเช่แหนบในน้ำมันตลอด ตอนจีบก็พยายามจุ่มน้ำมันไปด้วย จีบไปด้วย จะทำให้แป้งไม่ติดแหนบ  
    5. แบ่งแป้งออกมา ใส่ไส้ตรงกลาง ไม่ต้องใส่มาก เพราะจะทำให้ตอนปั้น แป้งแตก  
    6. การจีบมีหลายแบบ ในส่วนของเรา เราถนัดจีบจากด้านบน โดยเริ่ม 3 จีบก่อน... จีบ เป็น 3 เหลี่ยมดั่งรูป  
    7. ค่อยๆ จีบสับหว่างไปเรื่อยๆ เราจะจีบทั้งหมด 3 ชั้น โดยใช้แหนบใบไม้  
    8. ชั้นที่ 4 ที่เป็นฐาน เราจะเปลี่ยนมาใช้ แหนบเหลี่ยม  
    9. ตั้งไฟให้ร้อน นำใบตองวางรองตามภาพ ไม่ควรลองแบบปิดหมด เพราะจะทำให้ปิดรูไอน้ำที่จะขึ้นมา เมื่อวางเสร็จ พ่นน้ำหนึ่งครั้งที่ตัวขนม ปิดฝา นึ่งประมาณ 5 นาที  
    10. เมื่อครบห้านาที เปิดฝาออก พ่นน้ำ อีก1ครั้ง ก่อนนำออกจากหม้อ เพื่อเป็นการลดอุณภูมิตัวแป้ง  
    11. ทาน้ำมันบริเวณช่อมะลิ นำจัดลงจาน เราเลือกใช้กิ่งมะลิ แทนใบตอง  
        
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
