from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_85_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมช่อมรกต")

left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
ขนมช่อมรกต  สันนิษฐานว่า   น่าจะได้ชื่อมาจากสีสันของแป้งที่เป็นสีเขียว   คล้ายกับสีของ มรกต   ซึ่งเป็นอัญมณีที่มีค่า ขนมช่อมรกตเคยเป็นขนมยอดนิยมในสมัยโบราณ   นิยมทานกันในงานมงคลต่างๆ   ปัจจุบัน   ขนมช่อมรกตหาทานได้ยากขึ้น   แต่ยังมีบางร้านที่ยังคงทำขายอยู่   และสูตรขนมช่อมรกตก็มีการเผยแพร่ทางอินเทอร์เน็ต   
ทำให้คนทั่วไปสามารถลองทำทานเองได้
"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    ส่วนผสมแป้ง (ใช้ถ้วยตวงแห้ง)  
    1. แป้งข้าวเจ้า 1 ถ้วย  
    2. แป้งท้าว 1 ช้อนโต๊ะ  
    3. แป้งมัน 2 ช้อนโต๊ะ  
    4. น้ำ (ดอกอัญชัญแช่น้ำอุ่นจะเป็นสีน้ำเงิน-บีบน้ำมะนาว3-4หยดจะเป็นสีม่วง) 1 ถ้วย  
    

    ส่วนผสมไส้  
    5. อกไก่ หมู กุ้ง (นึ่งสุก-แยกน้ำเก็บไว้-สับละเอียด) 250 กรัม  
    6. ถั่วลิสง (คั่ว-ร่อน-โขลกละเอียด) 1/2 ถ้วย  
    7. หอมใหญ่ (หั่นชิ้นเล็กๆ ละเอียด) 1/2 ถ้วย  
    8. รากผักชี กระเทียม พริกไทย โขลกละเอียด 1 ช้อนโต๊ะ  
    9. น้ำตาลทราย 1/2 ถ้วย  
    10. เกลือ 2-3 ช้อนชา  
    11. น้ำมันสำหรับผัด 1/2 ถ้วย  
    

    โรยหน้าและผักเคียง  
    12. กระเทียม (สับ-เจียว) 1/2 ถ้วย  
    13. ผักชี  
    14. ผักกาดหอม  
    15. พริกขี้หนู  


    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
1. กะทะทอง ใส่แป้งข้าวจ้าว แป้งท้าว แป้งมัน  
ช่อม่วงใช้น้ำจากสีดอกอัญชัญ  
ช่อมรกตใช้น้ำคั้นจากใบเตย  
ช่อบุษราคัมใช้น้ำจากฟักทอง  
ช่อพวงชมพูใช้น้ำจากหัวบีทรูท
ผสมให้เข้ากัน ตั้งไฟกลาง กวนจนแป้งสุกใส ตักขึ้นมานวดจนนิ่ม ใช้แป้งมันทำแป้งนวล (ถ้ามากจะทำให้แข็ง) แบ่งแป้งปั้นเป็นก้อนกลม ใส่ถุงพักไว้  
  
2. กะทะใส่น้ำมัน ผัดเครื่องโขลก (รากผักชี กระเทียม พริกไทย) จนหอม เติมน้ำซุปที่นึ่งไก่ (เล็กน้อย) หอมสับ อกไก่สับ ผัดให้เข้ากัน จนสุก ปรุงรส น้ำตาลทราย เกลือ ให้มีรสเค็มนำ หวานตาม ผัดให้ตะหลิวยีๆ กดๆ  
  
3. แป้งก้อนกลม แผ่ออก ใส่ไส้ หุ้มให้มิด ใช้ที่จับจีบเป็นดอกชั้นแรกรอบวงกลม 6 – 7 กลีบ ชั้นที่สองไล่ชั้นขึ้นมาจับจีบเฉียงสับหว่างชั้นแรก ชั้นที่สาม จับจีบแทยง สามจีบคล้ายเกสร (เอาที่จีบจุ่มแป้งมันกันติด) วางเรียงในรังถึงปูใบตองทาน้ำมัน พรมน้ำก่อนนำไปนึ่งไฟแรง 5 – 8 นาที จนสุก จัดใส่จานทานกับผักกาดหอม ผักชี พริกขี้หนู กระเทียมเจียว  

    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
