import streamlit as st
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment (if any)
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_45_PATH1")

# Set page configuration
st.set_page_config(
    page_title="ขนมข้าวเหนียวทุเรียน: ขนมไทยโบราณ หอมหวาน",
    page_icon="🍚",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(image=header_img_path)
# Display title
st.title("ขนมข้าวเหนียวทุเรียน")
st.image(kanom_img_path, width=800)
# Display header image if exists

st.title("ความเป็นมา")
with st.expander("ความเป็นมา"):
    st.markdown(
        """
        ข้าวเหนียวทุเรียนเป็นขนมไทยที่ได้รับความนิยมอย่างมาก โดยเฉพาะในช่วงฤดูทุเรียน 
        นิยมทานคู่กับทุเรียนสุก โดยมีที่มาจากการนำข้าวเหนียวมูนมาราดด้วยกะทิเข้มข้นผสมกับเนื้อทุเรียนสุกจนเข้ากัน 
        กินแล้วได้รสชาติหวานมัน หอม อร่อย
        """
    )

st.title("วิธีทำ")
with st.expander("วิธีทำ"):
    st.markdown(
        """
        1. ข้าวเหนียวมูน:
            1. ล้างข้าวเหนียวเขี้ยวงูให้สะอาด แช่น้ำไว้ 3-4 ชั่วโมง
            2. เทน้ำออก นำข้าวเหนียวไปนึ่งจนสุก
            3. ในระหว่างที่นึ่งข้าวเหนียว ให้นำกะทิ เกลือ น้ำตาลทราย ใบเตย ใส่หม้อตั้งไฟอ่อน คนจนน้ำตาลละลาย
            4. เมื่อข้าวเหนียวสุก ตักใส่หม้อกะทิ คนให้เข้ากัน ปิดไฟ พักไว้ 10 นาที
        
        2. น้ำกะทิทุเรียน:
            1. แกะเนื้อทุเรียนสุก นำมาบดหรือยีให้ละเอียด
            2. ใส่น้ำกะทิ เกลือ น้ำตาลทราย ใบเตยลงในหม้อ ตั้งไฟอ่อน คนจนน้ำตาลละลาย
            3. ใส่เนื้อทุเรียนที่บดหรือยีไว้ลงไป คนให้เข้ากัน ปิดไฟ
        
        3. จัดเสิร์ฟ:
            1. ตักข้าวเหนียวมูนใส่จาน ราดด้วยน้ำกะทิทุเรียน ทานคู่กับทุเรียนสุก
        """
    )

st.title("ส่วนผสม")
with st.expander("ส่วนผสม"):
    st.markdown(
        """
        ข้าวเหนียวมูน:
        - ข้าวเหนียวเขี้ยวงู 500 กรัม
        - กะทิ 400 มิลลิลิตร
        - เกลือ 1/2 ช้อนชา
        - น้ำตาลทราย 1/2 ถ้วยตวง
        - ใบเตย 2-3 ใบ

        น้ำกะทิทุเรียน:
        - เนื้อทุเรียนสุก 200 กรัม
        - กะทิ 400 มิลลิลิตร
        - เกลือ 1/4 ช้อนชา
        - น้ำตาลทราย 1/4 ถ้วยตวง
        - ใบเตย 2-3 ใบ
        """
    )

st.title("เคล็ดลับ")
with st.expander("เคล็ดลับ"):
    st.markdown(
        """
        - เลือกใช้ข้าวเหนียวเขี้ยวงู จะทำให้ข้าวเหนียวมีกลิ่นหอม
        - แช่ข้าวเหนียวก่อนนึ่ง จะทำให้ข้าวเหนียวสุกเร็วและนุ่ม
        - กะทิควรเป็นกะทิสด จะทำให้ข้าวเหนียวมูนหอมมัน
        - ปรับความหวานของน้ำกะทิทุเรียนได้ตามชอบ
        - โรยเกลือเล็กน้อยบนข้าวเหนียวมูนก่อนทาน จะช่วยตัดรสหวาน
        """
    )

# Link to home page or another page
st.page_link("Home.py", label="Home", icon="↩️")
