from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_31_PATH1")

# Set page configuration
st.set_page_config(
    page_title="ขนมข้าวต้มน้ำวุ้น: เสน่ห์ของหวานเย็นชื่นใจจากภูมิปัญญาไทย",
    page_icon="🍚",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(image=header_img_path)
# Display title
st.title("ขนมข้าวต้มน้ำวุ้น: เสน่ห์ของหวานเย็นชื่นใจจากภูมิปัญญาไทย")
st.image(kanom_img_path)
st.title("ประวัติความเป็นมา")
with st.expander("ประวัติความเป็นมา"):
    st.markdown(
        """
        ขนมข้าวต้มน้ำวุ้นเป็นขนมไทยโบราณที่มีเอกลักษณ์เฉพาะตัวด้วยกรรมวิธีการทำที่เรียบง่ายแต่แฝงไว้ด้วยภูมิปัญญา ผสมผสานวัตถุดิบธรรมชาติที่หาได้ง่ายเข้าด้วยกันจนกลายเป็นเมนูหวานเย็นชื่นใจที่ได้รับความนิยมมาอย่างยาวนาน
        """
    )

st.title("เอกลักษณ์ของขนมข้าวต้มน้ำวุ้น")
with st.expander("เอกลักษณ์ของขนมข้าวต้มน้ำวุ้น"):
    st.markdown(
        """
        - **ความหอมมัน:** ขนมข้าวต้มน้ำวุ้นมีกลิ่นหอมจากใบตองและกะทิ
        - **ความนุ่มหนึบ:** ข้าวเหนียวที่ต้มจนสุกกำลังดี ให้สัมผัสนุ่มหนึบ ทานคู่กับน้ำเชื่อมเย็นๆ ชื่นใจ
        - **ความสดชื่น:** น้ำเชื่อมที่หวานหอมละมุน ทานคู่กับน้ำแข็ง ช่วยคลายร้อนได้เป็นอย่างดี
        """
    )

st.title("ส่วนผสมและวิธีทำ")
with st.expander("ส่วนผสมและวิธีทำ"):
    st.markdown(
        """
        **วัตถุดิบ:**
        - ข้าวเหนียวเขี้ยวงู 1 ถ้วย
        - กะทิ 1 กล่อง
        - ใบตอง
        - น้ำตาลทราย
        - เกลือ
        - น้ำเปล่า

        **วิธีทำ:**
        1. แช่ข้าวเหนียวเขี้ยวงูกับน้ำเปล่าประมาณ 3-4 ชั่วโมง
        2. เตรียมใบตองโดยล้างให้สะอาด ตัดเป็นชิ้นสี่เหลี่ยมจัตุรัส
        3. ผสมกะทิกับน้ำเปล่า เกลือ และน้ำตาลทราย ตั้งไฟเคี่ยวจนน้ำตาลทรายละลาย
        4. ตักข้าวเหนียวที่แช่ไว้ใส่ลงในใบตอง มัดด้วยตอก
        5. ตั้งน้ำให้เดือด นำขนมข้าวต้มน้ำวุ้นที่ห่อไว้ไปต้มประมาณ 45-60 นาที หรือจนกว่าข้าวเหนียวจะสุก
        6. ตักขนมข้าวต้มน้ำวุ้นที่ต้มสุกแล้วออกมาพักให้สะเด็ดน้ำ
        7. แกะใบตองออก ราดด้วยน้ำเชื่อม ทานคู่กับน้ำแข็ง
        """
    )

st.title("เคล็ดลับ")
with st.expander("เคล็ดลับ"):
    st.markdown(
        """
        - เลือกใช้ข้าวเหนียวเขี้ยวงูที่มีเมล็ดเรียวเล็ก จะทำให้ข้าวต้มน้ำวุ้นมีเนื้อสัมผัสนุ่มหนึบ
        - มัดใบตองให้แน่น เพื่อป้องกันไม่ให้น้ำไหลเข้าไปในตัวขนม
        - ปรับปริมาณน้ำตาลทรายได้ตามชอบ
        """
    )

st.title("การเก็บรักษา")
with st.expander("การเก็บรักษา"):
    st.markdown(
        """
        ขนมข้าวต้มน้ำวุ้นสามารถเก็บไว้ทานได้นาน 1-2 วัน โดยใส่ในภาชนะปิดฝาสนิท เก็บไว้ในตู้เย็น
        """
    )

st.title("คุณค่าทางโภชนาการ")
with st.expander("คุณค่าทางโภชนาการ"):
    st.markdown(
        """
        - ข้าวเหนียวเป็นแหล่งคาร์โบไฮเดรต ให้พลังงานแก่ร่างกาย
        - กะทิเป็นแหล่งไขมันดี
        - น้ำตาลทรายให้พลังงาน
        """
    )

st.page_link("Home.py", label="Home", icon="↩️")
