from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_119_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมถุงทอง")
# st.image(kanom_img_path)
left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
“ถุงทอง” เป็นอาหารว่างไทยโบราณที่มีชื่อเป็นมงคล เพราะ คำว่า “ถุงเงิน ถุงทอง” คล้ายกับการอวยพรให้ผู้ทานมีเงินมีทองใช้ตลอดไป ยิ่งใกล้ช่วงเทศกาลต่าง ๆ เช่น วันปีใหม่ การให้ขนมที่เป็นมงคลจะเกิดความสุขใจทั้งผู้ให้และผู้รับ สมัยก่อนนิยมทำขนมชนิดนี้ใช้ในงานมงคล แต่ปัจจุบันมักจะใช้ในงานเลี้ยงหรู ๆ ถุงทองถูกจัดให้เป็นอาหารเรียกนํ้าย่อยตามบุฟเฟ่ต์ หรือตามโต๊ะจีน ประมาณว่ากินแล้ว อยากกินจานต่อ ๆ ไปอีก เป็นของว่างประเภทเดียวกับกระทงทอง เปาะเปี๊ยะทอด ที่ทำได้ไม่ยากอย่างที่คิด วัตถุดิบก็หาง่าย แถมหน้าตาน่ากิน กลิ่นก็หอมเย้ายวนใจ ชวนนํ้าลายสออีกด้วย

"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
     รากผักชี 1 ต้น  
     กระเทียม 1 ช้อนโต๊ะ  
     พริกไทยป่น 1/2 ช้อนชา  
     เนื้อหมูบด 200 กรัม 
     เนื้อกุ้งบด 200 กรัม  
     แป้งข้าวโพด 2 ช้อนโต๊ะ  
     เมล็ดข้าวโพดต้มสุก 100 กรัม  
     เมล็ดถั่วลันเตา 100 กรัม  
     หอมใหญ่หั่นเต๋า 1 หัว  
     แครอทหั่นเต๋า 100 กรัม  
     เห็ดหอมแช่น้ำสับหยาบ 100 กรัม  
     ซอสปรุงรส 1 ช้อนโต๊ะ  
     น้ำตาลทราย 2 ช้อนโต๊ะ  
     เกลือป่น เล็กน้อยสำหรับปรุงรส  
     แผ่นแป้งปอเปี้ยะสำหรับห่อ  
     ต้นหอมลวก สำหรับผูก  
     น้ำจิ้มไก่  
     หรือน้ำจิ้มบ๊วยสำหรับรับประทานคู่ และน้ำมันพืช  
    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    1. โขลกรากผักชีกับกระเทียม และพริกไทยป่นเข้าด้วยกัน ตักใส่อ่างผสม ใส่หมูบด กุ้งบด แป้งข้าวโพด เมล็ดข้าวโพด เมล็ดถั่วลันเตา หอมใหญ่ เห็ดหอม และแครอทลงคนผสมให้เข้ากัน ปรุงรสด้วยซอสปรุงรส น้ำตาลทราย และเกลือป่น คนผสมให้เข้ากัน
    2. ใส่น้ำมันลงในกระทะ นำขึ้นตั้งไฟ ใส่ส่วนผสมหมูลงผัดจนสุก ตักขึ้น พักไว้จนเย็น
    3. วางส่วนผสมหมูผัดลงในแผ่นแป้ง ห่อให้สวยงาม มัดด้วยต้นหอมลวกให้สวยงาม เตรียมไว้
    4. ใส่น้ำมันลงในกระทะ นำขึ้นตั้งไฟปานกลางจนร้อน ใส่ถุงทองลงทอดจนเหลืองกรอบ ตักขึ้นสะเด็ดน้ำมัน จัดใส่จาน พร้อมรับประทานคู่กับน้ำจิ้มไก่ หรือน้ำจิ้มบ๊วย
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
