from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_114_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ถั่วทอด: ความเป็นมา วิธีทำ และส่วนผสม",
    page_icon="🍴",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(image=header_img_path)
# Display title
st.title("ถั่วทอด")
st.image(kanom_img_path)
st.title("ความเป็นมา")
with st.expander("ความเป็นมา"):
    st.markdown(
        """
        ถั่วทอด ถั่วทอดแผ่น คือ ขนมที่ทำมาจากถั่วลิสง นำไปผสมกับแป้ง และส่วนผสมอื่น ๆ เป็นแผ่นแป้งกลม ๆ มีถั่วลิสงอยู่เต็มแผ่น รสชาติกรอบมัน เค็ม หวาน โดยขนมถั่วทอดนี้ มีต้นตำรับมาจาก ถั่วทอดลอนศิลป 200 ปี ที่ได้ถูกผลิตขึ้นครั้งแรก ณ ร้านที่มีชื่อว่า “ลอนศิลป” อ.ศรีสำโรง จ.สุโขทัย โดยเจ้าของสูตรดั้งเดิมนั้น มีพี่น้อง 3 คน คือ น.ส.จรูญ, น.ส.จำรัส และน.ส. บุญทวน ตระกูลมังกร ซึ่งทำขนมถั่วทอด เป็นงานอดิเรกเสริมรายได้ยามจากงานหลักของร้านลอนศิลป คือ การเย็บเสื้อผ้า และทำผมสตรีนั่นเอง
        """
    )

st.title("ส่วนผสม")
with st.expander("ส่วนผสม"):
    st.markdown(
        """
        - ถั่วลิสงดิบ 500 กรัม
        - แป้งข้าวเจ้า 2 ช้อนโต๊ะ
        - แป้งสาลีอเนกประสงค์ 250 กรัม
        - ไข่ไก่ 2 ฟอง
        - น้ำตาลทราย 200 กรัม
        - เกลือป่น 1 ช้อนชา
        - น้ำปูนใส 300 กรัม
        - น้ำกะทิ 1 ถ้วย
        - น้ำมัน สำหรับทอด
        - พิมพ์ถั่วทอด
        """
    )

st.title("วิธีทำถั่วทอด")
with st.expander("วิธีทำถั่วทอด"):
    st.markdown(
        """
        1. เตรียมชามผสม ใส่แป้งข้าวเจ้า แป้งสาลีอเนกประสงค์ และเกลือป่น คนพอเข้ากัน
        2. จากนั้น ค่อย ๆ เติมน้ำปูนใสลงไป นวดจนส่วนผสมเข้ากันดี ใส่ไข่ไก่ลงไป นวดผสมต่อให้เข้ากัน
        3. เติมน้ำกะทิ คนให้เข้ากัน แล้วใส่น้ำตาลทรายลงไป นวดจนน้ำตาลละลาย นำไปกรองด้วยผ้าขาวบาง หรือกระชอนตาถี่ พักแป้งไว้ 20-30 นาที เพื่อให้ได้แป้งเซ็ตตัว และมีความเนียนละเอียด
        4. ตั้งกระทะ ใส่น้ำมันลง นำพิมพ์ถั่วทอด ลงแช่ในน้ำมัน รอให้ร้อนได้ที ปรับเป็นไฟกลาง นำพิมพ์ขึ้นมา
        5. ตักแป้งใส่พิมพ์ โรยถั่วลิสงลงไปให้ทั่วพิมพ์ นำพิมพ์วางลงทอดในน้ำมัน ให้แป้งเซ็ตตัวประมาณ 2 นาที
        6. พอแป้งเริ่มสุก ให้จุ่มพิมพ์ลงในน้ำมัน ใช้ไฟกลางค่อนไปทางอ่อน ขนมจะลอยตัวหลุดพิมพ์เอง ทอดจนแผ่นถั่วเหลืองกรอบทั้ง 2 ด้าน ทำวนแบบนี้ไปเรื่อย ๆ จนแป้งหมด
        7. ตักขึ้นพักให้สะเด็ดน้ำมัน รอจนเย็น จัดใส่จาน พร้อมเสิร์ฟ หรือเก็บใส่ภาชนะที่มีฝาปิดมิดชิด พร้อมทาน
        """
    )

# Link to home page or another page
st.page_link("Home.py", label="Home", icon="↩️")
