from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_135_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมน้ำตาลปั้น: ของหวานโบราณที่เปี่ยมด้วยเสน่ห์และฝีมือ",
    page_icon="🍬",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมน้ำตาลปั้น: ของหวานโบราณที่เปี่ยมด้วยเสน่ห์และฝีมือ")
st.image(kanom_img_path)
st.title("ความเป็นมา")
with st.expander("ความเป็นมา"):
    st.markdown(
        """
        ขนมน้ำตาลปั้น หรือที่รู้จักกันในชื่อ "ลูกกวาดน้ำตาลปั้น" เป็นขนมหวานโบราณที่มีมายาวนานหลายร้อยปี เชื่อกันว่ามีต้นกำเนิดมาจากประเทศอินเดีย โดยแพร่หลายไปยังประเทศต่างๆ ในเอเชีย รวมถึงประเทศไทย
        ในอดีต ขนมน้ำตาลปั้นนิยมทำและขายตามงานวัด งานประจำปี หรือตามท้องถนน ผู้ขายจะใช้ฝีมือและความประณีตในการปั้นน้ำตาลให้เป็นรูปสัตว์ สิ่งของ หรือตัวละครต่างๆ ซึ่งดึงดูดความสนใจของเด็กๆ และผู้ใหญ่เป็นอย่างมาก
        ปัจจุบัน ขนมน้ำตาลปั้นหาซื้อได้ยากขึ้น แต่ยังพอมีร้านที่ทำและขายอยู่บ้าง ส่วนใหญ่จะเป็นร้านที่ตั้งอยู่ในแหล่งชุมชนเก่า หรือตามงานเทศกาลต่างๆ
        """
    )

st.title("วิธีทำ")
with st.expander("วิธีทำ"):
    st.markdown(
        """
        การทำขนมน้ำตาลปั้นนั้น ต้องอาศัยทั้งฝีมือและความอดทน โดยขั้นตอนคร่าวๆ ดังนี้
        1. เตรียมน้ำตาลทราย: นำน้ำตาลทรายไปละลายกับน้ำร้อน คนจนน้ำตาลละลายหมด จากนั้นเคี่ยวต่อจนน้ำตาลเหนียวข้น
        2. แต่งสี: ใส่สีผสมอาหารลงในน้ำตาลละลาย คนให้เข้ากันจนได้สีที่ต้องการ
        3. ปั้นน้ำตาล: เทน้ำตาลละลายที่เตรียมไว้ลงบนแผ่นหินอ่อน รอจนน้ำตาลเริ่มเย็นลง จากนั้นใช้ไม้ปลายแหลมหรืออุปกรณ์ปั้น ปั้นน้ำตาลเป็นรูปต่างๆ ตามต้องการ
        4. ตกแต่ง: เมื่อปั้นน้ำตาลเสร็จ สามารถตกแต่งเพิ่มเติมด้วยสีผสมอาหารหรือเกล็ดน้ำตาล
        """
    )

st.title("ส่วนผสม")
with st.expander("ส่วนผสม"):
    st.markdown(
        """
        - น้ำตาลทราย
        - น้ำร้อน
        - สีผสมอาหาร (ตามชอบ)
        """
    )

st.title("หมายเหตุ")
with st.expander("หมายเหตุ"):
    st.markdown(
        """
        - อุณหภูมิของน้ำตาลที่ใช้ปั้นควรอยู่ที่ประมาณ 80 องศาเซลเซียส
        - ควรใช้ความระมัดระวังในการปั้นน้ำตาลร้อน
        - ขนมน้ำตาลปั้นสามารถเก็บไว้ได้นานประมาณ 1-2 สัปดาห์ โดยใส่ในภาชนะที่ปิดสนิทและเก็บไว้ที่อุณหภูมิห้อง
        """
    )

st.page_link("Home.py", label="Home", icon="↩️")
