from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_194_PATH1")

# Set page configuration
st.set_page_config(
    page_title="ขนมลูกชุบ: เสน่ห์ของขนมไทยโบราณ สีสันสดใส รสชาติกลมกล่อม",
    page_icon="🍬",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(image=header_img_path)
# Display main image and title
st.image(image=header_img_path)
st.title("ขนมลูกชุบ: เสน่ห์ของขนมไทยโบราณ สีสันสดใส รสชาติกลมกล่อม")
st.image(kanom_img_path)
st.title("ที่มา")
with st.expander("ที่มา"):
    st.markdown(
        """
        ลูกชุบ มีต้นกำเนิดมาจากโปรตุเกส ในสมัยอยุธยา พ่อค้าชาวโปรตุเกสนำขนมชนิดหนึ่งชื่อว่า "Massapaes" ซึ่งทำจากอัลมอนด์บด มาเผยแพร่ในไทย ต่อมาคนไทยได้ดัดแปลงสูตร โดยเปลี่ยนจากอัลมอนด์มาใช้วัตถุดิบที่หาได้ง่ายในท้องถิ่นอย่างถั่วเขียว
    """
    )

st.title("สูตรและส่วนผสม")
with st.expander("สูตรและส่วนผสม"):
    st.markdown(
        """
        **ไส้ถั่วกวน**
        - ถั่วเขียวเลาะเปลือก 2 ถ้วยตวง
        - น้ำตาลทราย 1 ถ้วยตวง
        - กะทิ 1 ถ้วยตวง
        - เกลือ 1/2 ช้อนชา
        - น้ำเปล่า 1/2 ถ้วยตวง

        **วิธีทำไส้ถั่วกวน**
        1. นำถั่วเขียวไปล้างและแช่น้ำจนนิ่ม
        2. นำถั่วเขียวที่แช่น้ำไว้ ต้มจนสุก
        3. เทถั่วเขียวที่ต้มสุก น้ำตาลทราย กะทิ และเกลือ ลงในหม้อ
        4. ตั้งไฟปานกลาง คนเรื่อยๆจนไส้ถั่วข้นเหนียว
        5. เทไส้ถั่วลงในถาด พักให้เย็น
        6. ปั้นไส้ถั่วเป็นรูปต่างๆ เช่น ผลไม้ ดอกไม้ สัตว์

        **วุ้นชุบ**
        - ผงวุ้น 2 ช้อนโต๊ะ
        - น้ำเปล่า 4 ถ้วยตวง
        - น้ำตาลทราย 1/2 ถ้วยตวง
        - สีผสมอาหารตามชอบ

        **วิธีทำวุ้นชุบ**
        1. นำผงวุ้นละลายน้ำเปล่า พักไว้
        2. ตั้งไฟ ใส่น้ำตาลทราย คนจนละลาย
        3. เทน้ำวุ้นละลายลงในน้ำเชื่อม คนให้เข้ากัน
        4. แบ่งวุ้นเป็นส่วนๆ ใส่สีผสมอาหารตามชอบ
        5. นำไส้ถั่วที่ปั้นไว้ไปชุบวุ้นให้ทั่ว
        6. วางลูกชุบพักบนตะแกรง พักให้วุ้นแข็ง
    """
    )

st.title("หมายเหตุ")
with st.expander("หมายเหตุ"):
    st.markdown(
        """
        - สูตรและส่วนผสมสามารถปรับได้ตามความชอบ
        - เลือกใช้สีผสมอาหารที่มีคุณภาพ
        - ตกแต่งลูกชุบเพิ่มเติมด้วย รายละเอียด เช่น ใบเตย ถั่วตัด งาคั่ว
        - เก็บลูกชุบในตู้เย็น ช่องธรรมดา ประมาณ 2-3 วัน
    """
    )

st.title("คุณค่าทางโภชนาการ")
with st.expander("คุณค่าทางโภชนาการ"):
    st.markdown(
        """
        ขนมลูกชุบ ให้พลังงานจากคาร์โบไฮเดรต ไขมัน และโปรตีน
    """
    )

st.page_link("Home.py", label="Home", icon="↩️")
