from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_203_PATH1")
# Set page configuration
st.set_page_config(
    page_title="วุ้นสังขยา: ความหวานละมุนของวุ้นและสังขยาที่รวมกัน",
    page_icon="🍮",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(image=header_img_path)
# Display title
st.title("วุ้นสังขยา: ความหวานละมุนของวุ้นและสังขยาที่รวมกัน")
st.image(kanom_img_path)
st.title("ประวัติความเป็นมา")
with st.expander("เกี่ยวกับวุ้นสังขยา"):
    st.markdown(
        """
        **วุ้นสังขยา** เป็นขนมหวานไทยที่ผสมผสานความอร่อยสดชื่นของวุ้นกับความหอมหวานมันของสังขยาเข้าไว้ด้วยกัน มีต้นกำเนิดจากการดัดแปลงสูตรขนมสังขยาโบราณ เชื่อกันว่ามีกำเนิดมาจากประเทศจีนและได้รับการนำเข้ามาใช้ในการทำขนมไทย

        ในปัจจุบัน วุ้นสังขยาเป็นที่นิยมในงานมงคลและงานเฉลิมฉลองต่างๆ ด้วยรสชาติที่หวานละมุน มีความเย็นสดชื่นจากวุ้นและความหอมของสังขยาที่ผสมกันอย่างลงตัว
    """
    )

st.title("ส่วนผสม")
with st.expander("ส่วนผสมสำหรับวุ้น"):
    st.markdown(
        """
        - ผงวุ้น 1 ช้อนโต๊ะ
        - น้ำเปล่า 2 ถ้วยตวง
        - น้ำตาลทราย 1/2 ถ้วยตวง
    """
    )

with st.expander("ส่วนผสมสำหรับสังขยา"):
    st.markdown(
        """
        - ไข่ไก่ 2 ฟอง
        - กะทิ 1 ถ้วยตวง
        - น้ำตาลปี๊บ 1/2 ถ้วยตวง
        - ใบเตย 2-3 ใบ (สำหรับสังขยาใบเตย)
        - เกลือ 1/4 ช้อนชา
    """
    )

st.title("วิธีทำ")
with st.expander("วิธีทำวุ้นสังขยา"):
    st.markdown(
        """
        **ทำวุ้น:**
        1. ผสมผงวุ้นกับน้ำเปล่า พักไว้ 10 นาที ตั้งไฟคนจนผงวุ้นละลาย ใส่น้ำตาลทราย คนจนละลาย ปิดไฟ พักไว้ให้เย็น

        **ทำสังขยา:**
        1. ตีไข่กับน้ำตาลปี๊บจนเข้ากันดี ใส่กะทิ ใบเตย (ถ้ามี) และเกลือ ลงไปตีต่อจนเข้ากันดี กรองส่วนผสมด้วยตะแกรงเพื่อเอาเศษไข่ขาวออก

        **ประกอบวุ้นสังขยา:**
        1. เทวุ้นที่เย็นแล้วลงในพิมพ์ รอให้เซ็ตตัว
        2. เทสังขยาลงบนวุ้น รอให้เซ็ตตัว

        **เสิร์ฟ:**
        - นำวุ้นสังขยาไปแช่เย็น ก่อนนำมาตัดเสิร์ฟ
    """
    )

st.title("เคล็ดลับ")
with st.expander("เคล็ดลับ"):
    st.markdown(
        """
        - สามารถปรับปริมาณน้ำตาลได้ตามความชอบ
        - สามารถใส่กลิ่นวานิลลาหรือกลิ่นมะลิเพิ่มเติมได้
        - สำหรับสังขยาฟักทอง นำฟักทองมาบดละเอียดแล้วนำไปผสมกับไข่ น้ำตาล และกะทิ
        - สำหรับสังขยาชาไทย ใส่นมชาไทยหรือผงชาไทยลงไปในส่วนผสม
    """
    )

st.page_link("Home.py", label="Home", icon="↩️")
