from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_201_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

st.image(image=header_img_path)
st.title("วุ้นไข่")
st.image(kanom_img_path)
# left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
multi = """
ขนมวุ้นแบบไทยๆ ไม่ได้มีแค่วุ้นกะทิเท่านั้น แต่ยังมี “วุ้นไข่” อีกหนึ่งความอร่อยที่มีส่วนผสมทั้งของคาวและของหวานเข้าด้วยกัน โดยตัววุ้นจะมีลักษณะใส มองเห็นเส้นสายของไข่สวยงามถึงด้านใน และรสชาติหวานกรอบอร่อยอีกด้วย
"""
st.markdown(multi)
# with cent_co:
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    สูตรนี้สำหรับเสิร์ฟวุ้นไข่จำนวน 6 ชิ้น  
    ไข่ไก่ 2 ฟอง  
    ผงวุ้นตรานางเงือก 1 ช้อนโต๊ะ  
    น้ำตาลทราย 3/4 ถ้วยตวง (ความหวานปรับลดได้ตามใจชอบ)  
    น้ำเปล่า 500 มิลลิลิตร   
    กลิ่นมะลิ หรือกลิ่นวานิลลา หรือใบเตย ตามใจชอบ  
    ถาดใส่วุ้นขนาด 6x6x2 นิ้ว หรือใช้แม่พิมพ์ได้ตามใจชอบ  
         
    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    1. แช่ผงวุ้น 1 ช้อนโต๊ะลงในน้ำเปล่าขนาด 500 มิลลิลิตร คนผงวุ้นให้ละลายไปกับน้ำ และพักทิ้งไว้เพื่อให้วุ้นละลาย และอิ่มน้ำประมาณ 10 นาที
    2. ระหว่างรอผงวุ้นให้นำไข่ไก่ 2 ฟองมาตอก และตีให้ไข่แตกไปเรื่อยๆ ให้แตกจนไข่ขาว และไข่แดงผสมกันดี
    3. นำผงวุ้นที่แช่ไว้มาขึ้นตั้งไฟด้วยไฟกลาง พร้อมคนไปเรื่อยๆ จนผงวุ้นเริ่มละลายไม่เป็นเม็ด และควรเช็ดด้วยการดูตามทัพพีว่ายังมีผงวุ้นติดขึ้นมาหรือไม่ ถ้าไม่มีแสดงว่าผงวุ้นใช้ได้แล้ว ซึ่งถ้าเราปล่อยให้ผงวุ้นละลายไม่ดีอาจจะทำให้วุ้นนิ่มไม่เซ็ตตัว และตัววุ้นจะเกิดการคายน้ำได้
    4. เติมน้ำตาลทรายจำนวน 3/4 ถ้วยตวงตามลงไป พร้อมคนให้น้ำตาลละลาย
    5. พอน้ำเริ่มเดือด ค่อยๆ เทไข่ลงไป ด้วยการยกไข่ให้สูงเพื่อให้เวลาเทมีลักษณะเป็นสาย เป็นเส้นเล็กๆ และคนไข่กะน้ำต่อประมาณ 2-3 นาทีเพื่อให้ไข่สุก และไม่จับตัวเป็นก้อน เมื่อไข่สุกก็เป็นอันใช้ได้
    6. เพิ่มความหอมของวุ้นไข่ และกลบกลิ่นที่อาจจะคาวของไข่ แนะนำให้ใส่กลิ่นมะลิ 3-4 หยด หรือใครชอบกลิ่นอื่น เช่น กลิ่นวานิลลา หรือกล่นใบเตยก็สามารถใช้ได้เลย 7. จากนั้นจึงปิดไฟ โดยหลังจากปิดไฟแล้วถ้าหากวุ้นมีฟองมากให้คนในหม้อต่อ เพราะการคนไปเรื่อยๆ จะทำให้ฟองจะค่อยๆ ลดลงได้
    8. นำเทใส่ถาด หรือแม่พิมพ์ พักทิ้งไว้ให้วุ้นเซ็ตตัว 1-2 ชั่วโมง ด้วยอุณหภูมิห้อง
    9. เสร็จแล้วนำมาตัดแบ่ง พร้อมเสิร์ฟได้เลย และเพื่อเพิ่มความอร่อยชื่นใจ ขอแนะนำให้ใส่ตู้เย็นก่อนทานค่ะ
    """
    st.markdown(multi)
st.page_link("Home.py", label="Home", icon="↩️")
