from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_202_PATH1")

# Set page configuration
st.set_page_config(
    page_title="วุ้นลูกแก้วอัญชันมะพร้าวอ่อน: ขนมหวานไทยเย็นชื่นใจ",
    page_icon="🍧",
    layout="wide",
    initial_sidebar_state="expanded",
)
st.image(image=header_img_path)
# Display title
st.title("วุ้นลูกแก้วอัญชันมะพร้าวอ่อน: ขนมหวานไทยเย็นชื่นใจ")
st.image(kanom_img_path)
st.title("ที่มา")
with st.expander("ความเป็นมา"):
    st.markdown(
        """
        วุ้นลูกแก้ว มีต้นกำเนิดมาจากประเทศจีน โดยชาวจีนนำแป้งสาลีมาต้มกับน้ำ จนเหนียวข้น เทใส่พิมพ์ที่มีลักษณะเป็นรู กลายเป็นวุ้นลูกแก้ว ต่อมาวุ้นลูกแก้วได้ถูกเผยแพร่ไปยังประเทศต่างๆ รวมถึงประเทศไทย คนไทยได้นำวุ้นลูกแก้วมาดัดแปลงสูตร โดยใช้วัตถุดิบในท้องถิ่น เช่น ดอกอัญชัน กะทิ และมะพร้าวอ่อน กลายเป็นวุ้นลูกแก้วอัญชันมะพร้าวอ่อนที่เรารู้จักกันในปัจจุบัน
    """
    )

st.title("วิธีทำ")
with st.expander("วิธีทำ"):
    st.markdown(
        """
        **ส่วนผสม วุ้นลูกแก้วอัญชัน**
        - ดอกอัญชัน 10 ดอก
        - น้ำเปล่า 1 ถ้วยตวง
        - น้ำตาลทราย 1/2 ถ้วยตวง
        - ผงวุ้น 1 ช้อนโต๊ะ
        
        **ส่วนผสม น้ำกะทิ**
        - กะทิ 1 กล่อง
        - น้ำเปล่า 1 ถ้วยตวง
        - เกลือ 1/4 ช้อนชา
        - น้ำตาลทราย 1/4 ถ้วยตวง
        - ใบเตย 2-3 ใบ
        
        **ส่วนผสม เนื้อมะพร้าวอ่อน**
        - เนื้อมะพร้าวอ่อน 1 ถ้วยตวง
        
        **วิธีทำ**
        1. ทำวุ้นลูกแก้วอัญชัน
           - นำดอกอัญชันไปล้างน้ำให้สะอาด แช่น้ำเปล่า 1 ถ้วยตวง ประมาณ 10 นาที จนน้ำเปลี่ยนเป็นสีม่วง
           - กรองน้ำอัญชัน ใส่หม้อ ใส่น้ำตาลทราย ตั้งไฟจนน้ำตาลทรายละลาย
           - ใส่วุ้นผง คนให้เข้ากัน รอจนวุ้นผงละลาย
           - เทน้ำวุ้นอัญชันใส่พิมพ์ลูกแก้ว รอให้วุ้นเซ็ตตัว
        2. ทำน้ำกะทิ
           - ผสมกะทิ น้ำเปล่า เกลือ น้ำตาลทราย ใบเตย ตั้งไฟจนน้ำตาลทรายละลาย
           - ยกลงจากเตา รอให้เย็น
        3. เตรียมเนื้อมะพร้าวอ่อน
           - นำเนื้อมะพร้าวอ่อนมาหั่นเป็นชิ้นพอดีคำ
        4. ประกอบวุ้นลูกแก้วอัญชันมะพร้าวอ่อน
           - ตักวุ้นลูกแก้วอัญชันใส่ถ้วย
           - ราดด้วยน้ำกะทิ
           - โรยหน้าด้วยเนื้อมะพร้าวอ่อน
        
        **หมายเหตุ**
        - สามารถปรับสูตรและส่วนผสมได้ตามความชอบ
        - เลือกใช้ดอกอัญชันสดๆ จะได้สีม่วงที่สวย
        - แช่วุ้นลูกแก้วอัญชันในน้ำเย็น ประมาณ 10 นาที ก่อนนำมาราดด้วยน้ำกะทิ จะช่วยให้วุ้นลูกแก้วอัญชันไม่ยุ่ย
        - วุ้นลูกแก้วอัญชันมะพร้าวอ่อนสามารถเก็บไว้ในตู้เย็นได้นาน 3-4 วัน
    """
    )

st.page_link("Home.py", label="Home", icon="↩️")
