from ultralytics import YOLO
import cv2
import streamlit as st
from PIL import Image
import numpy as np
from dotenv import load_dotenv
import os

# Load variables from .env
load_dotenv()
# Get the paths from the environment
header_img_path = os.getenv("HEADER_IMG_PATH")
kanom_img_path = os.getenv("COMPONENT_181_PATH1")
# component_1_path = os.getenv("COMPONENT_KluaiChap_PATH2")
# component_2_path = os.getenv("COMPONENT_KluaiChap_PATH3")

# Set page configuration
st.set_page_config(
    page_title="ขนมไทยอะไรเอ่ย??",
    page_icon="🧁",
    layout="wide",
    initial_sidebar_state="expanded",
)

# Display main image and title
st.image(image=header_img_path)
st.title("ขนมเม็ดขนุน")
st.image(kanom_img_path)
left_co, cent_co, last_co = st.columns(3)
st.title("ความเป็นมา")
with cent_co:
    st.image(image=kanom_img_path, width=600)

multi = """
ขนมเม็ดขนุน เป็นขนมไทยโบราณที่มีมาตั้งแต่สมัยอยุธยา โดยเชื่อกันว่าขนมชนิดนี้ได้รับอิทธิพลมาจากขนมโปรตุเกส นิยมทำกันในงานมงคลต่างๆ เพราะชื่อ "เม็ดขนุน" พ้องเสียงกับคำว่า "หนุน" มีความหมายเป็นการอวยพรให้เจริญก้าวหน้าในหน้าที่การงาน
"""
st.markdown(multi)
col1, col2 = st.columns(2)

with col1:
    st.header("ส่วนประกอบ")
    multi = """
    ตัวไส้:
    - ถั่วเขียวเลาะเปลือก 250 กรัม
    - กะทิ 250 มิลลิลิตร
    - น้ำตาลทราย 80 กรัม
    - เกลือป่น 1/4 ช้อนชา

    น้ำเชื่อมใส:
    - น้ำเปล่า 3 ถ้วยตวง
    - น้ำตาลทราย 3 ถ้วยตวง
    - ใบเตยมัด 1 มัด
    - กลิ่นมะลิ 1/2 ช้อนชา

    น้ำเชื่อมข้น:
    - น้ำเปล่า 800 มิลลิลิตร
    - น้ำตาลทราย 1000 กรัม
    - ใบเตยมัด 1 มัด
    - กลิ่นมะลิ 1/2 ช้อนชา

    ไข่แดง:
    - ไข่แดงของไข่เป็ด 3 ฟอง
    """
    st.markdown(multi)
with col2:
    st.header("วิธีทำ")
    multi = """
    1. เตรียมไส้:
    - ล้างถั่วเขียวเลาะเปลือก แช่น้ำไว้ 3-4 ชั่วโมง
    - นำถั่วเขียวไปนึ่งจนสุก
    - บดถั่วเขียวที่นึ่งสุกจนเนียน
    - ใส่น้ำตาลทราย เกลือ และกะทิ
    - นำส่วนผสมไปกวนจนเหนียวข้น
    - พักไส้ไว้ให้เย็น

    2. เตรียมน้ำเชื่อมใส:
    - ตั้งน้ำเปล่าให้เดือด
    - ใส่น้ำตาลทราย ใบเตย และกลิ่นมะลิ
    - เคี่ยวจนน้ำตาลทรายละลาย
    - ปิดไฟ พักไว้

    3. เตรียมน้ำเชื่อมข้น:
    - ตั้งน้ำเปล่าให้เดือด
    - ใส่น้ำตาลทราย ใบเตย และกลิ่นมะลิ
    - เคี่ยวจนน้ำตาลทรายละลาย
    - ปิดไฟ พักไว้

    4. ปั้นเม็ดขนุน:
    - แบ่งไส้ถั่วเป็นก้อนกลมๆ
    - ปั้นก้อนไส้ให้เป็นรูปรีคล้ายเม็ดขนุน

    5. ชุบไข่:
    - ตีไข่แดงกับน้ำเปล่าเล็กน้อย
    - นำเม็ดขนุนที่ปั้นไว้ไปชุบไข่

    6. ต้มเม็ดขนุน:
    - ตั้งน้ำเชื่อมใสให้เดือด
    - ใส่เม็ดขนุนที่ชุบไข่ลงต้มจนสุก
    - ตักเม็ดขนุนขึ้นพักให้สะเด็ดน้ำ

    7. แช่เม็ดขนุนในน้ำเชื่อมข้น:
    - นำเม็ดขนุนที่ต้มสุกแล้วแช่ลงในน้ำเชื่อมข้น
    - แช่ไว้ประมาณ 10-15 นาที

    8. จัดเสิร์ฟ:
    - ตักเม็ดขนุนที่แช่ในน้ำเชื่อมข้นใส่จาน
    - ราดด้วยน้ำเชื่อมข้น
    - โรยหน้าด้วยงาขาวคั่ว

    เคล็ดลับ:
    - เลือกใช้ถั่วเขียวที่มีเมล็ดโต
    - กวนไส้จนเหนียวข้น
    - ปั้นเม็ดขนุนให้มีขนาดเท่ากัน
    - ต้มเม็ดขนุนจนสุก
    - แช่เม็ดขนุนในน้ำเชื่อมข้นจนเข้าเนื้อ
    """
    st.markdown(multi)

st.page_link("Home.py", label="Home", icon="↩️")
